/* automatically generated by rust-bindgen 0.63.0 */

pub const RUBY_H: u32 = 1;
pub const HAVE_RUBY_ATOMIC_H: u32 = 1;
pub const HAVE_RUBY_DEBUG_H: u32 = 1;
pub const HAVE_RUBY_DEFINES_H: u32 = 1;
pub const HAVE_RUBY_ENCODING_H: u32 = 1;
pub const HAVE_RUBY_FIBER_SCHEDULER_H: u32 = 1;
pub const HAVE_RUBY_INTERN_H: u32 = 1;
pub const HAVE_RUBY_IO_H: u32 = 1;
pub const HAVE_RUBY_MEMORY_VIEW_H: u32 = 1;
pub const HAVE_RUBY_MISSING_H: u32 = 1;
pub const HAVE_RUBY_ONIGMO_H: u32 = 1;
pub const HAVE_RUBY_ONIGURUMA_H: u32 = 1;
pub const HAVE_RUBY_RACTOR_H: u32 = 1;
pub const HAVE_RUBY_RANDOM_H: u32 = 1;
pub const HAVE_RUBY_RE_H: u32 = 1;
pub const HAVE_RUBY_REGEX_H: u32 = 1;
pub const HAVE_RUBY_RUBY_H: u32 = 1;
pub const HAVE_RUBY_ST_H: u32 = 1;
pub const HAVE_RUBY_THREAD_H: u32 = 1;
pub const HAVE_RUBY_THREAD_NATIVE_H: u32 = 1;
pub const HAVE_RUBY_UTIL_H: u32 = 1;
pub const HAVE_RUBY_VERSION_H: u32 = 1;
pub const HAVE_RUBY_VM_H: u32 = 1;
pub const RUBY_RUBY_H: u32 = 1;
pub const INCLUDE_RUBY_CONFIG_H: u32 = 1;
pub const RUBY_ABI_VERSION: u32 = 3;
pub const STDC_HEADERS: u32 = 1;
pub const HAVE_SYS_TYPES_H: u32 = 1;
pub const HAVE_SYS_STAT_H: u32 = 1;
pub const HAVE_STDLIB_H: u32 = 1;
pub const HAVE_STRING_H: u32 = 1;
pub const HAVE_MEMORY_H: u32 = 1;
pub const HAVE_STRINGS_H: u32 = 1;
pub const HAVE_INTTYPES_H: u32 = 1;
pub const HAVE_STDINT_H: u32 = 1;
pub const HAVE_UNISTD_H: u32 = 1;
pub const __EXTENSIONS__: u32 = 1;
pub const _ALL_SOURCE: u32 = 1;

pub const RB_EVENT_HOOKS_HAVE_CALLBACK_DATA: u32 = 1;
pub const RUBY_INTEGER_UNIFICATION: u32 = 1;
pub const RB_BLOCK_CALL_FUNC_STRICT: u32 = 1;
pub const RUBY_BLOCK_CALL_FUNC_TAKES_BLOCKARG: u32 = 1;
pub const RUBY_ALLOCV_LIMIT: u32 = 1024;
pub const UNLIMITED_ARGUMENTS: i32 = -1;
pub const RB_SCAN_ARGS_PASS_CALLED_KEYWORDS: u32 = 0;
pub const RB_SCAN_ARGS_KEYWORDS: u32 = 1;
pub const RB_SCAN_ARGS_LAST_HASH_KEYWORDS: u32 = 3;
pub const RB_NO_KEYWORDS: u32 = 0;
pub const RB_PASS_KEYWORDS: u32 = 1;
pub const HAVE_RB_SCAN_ARGS_OPTIONAL_HASH: u32 = 1;
pub const PRI_INT_PREFIX: &[u8; 1usize] = b"\0";
pub const PRI_LONG_PREFIX: &[u8; 2usize] = b"l\0";
pub const PRI_SHORT_PREFIX: &[u8; 2usize] = b"h\0";
pub const RUBY_PRI_VALUE_MARK: &[u8; 2usize] = b"\x0B\0";
pub const PRIdVALUE: &[u8; 3usize] = b"ld\0";
pub const PRIoVALUE: &[u8; 3usize] = b"lo\0";
pub const PRIuVALUE: &[u8; 3usize] = b"lu\0";
pub const PRIxVALUE: &[u8; 3usize] = b"lx\0";
pub const PRIXVALUE: &[u8; 3usize] = b"lX\0";
pub const PRIsVALUE: &[u8; 4usize] = b"li\x0B\0";
pub const PRIdPTRDIFF: &[u8; 3usize] = b"td\0";
pub const PRIiPTRDIFF: &[u8; 3usize] = b"ti\0";
pub const PRIoPTRDIFF: &[u8; 3usize] = b"to\0";
pub const PRIuPTRDIFF: &[u8; 3usize] = b"tu\0";
pub const PRIxPTRDIFF: &[u8; 3usize] = b"tx\0";
pub const PRIXPTRDIFF: &[u8; 3usize] = b"tX\0";
pub const PRIdSIZE: &[u8; 3usize] = b"zd\0";
pub const PRIiSIZE: &[u8; 3usize] = b"zi\0";
pub const PRIoSIZE: &[u8; 3usize] = b"zo\0";
pub const PRIuSIZE: &[u8; 3usize] = b"zu\0";
pub const PRIxSIZE: &[u8; 3usize] = b"zx\0";
pub const PRIXSIZE: &[u8; 3usize] = b"zX\0";
pub const USE_SYMBOL_AS_METHOD_NAME: u32 = 1;
pub const RUBY_INTERN_H: u32 = 1;
pub const INTEGER_PACK_MSWORD_FIRST: u32 = 1;
pub const INTEGER_PACK_LSWORD_FIRST: u32 = 2;
pub const INTEGER_PACK_MSBYTE_FIRST: u32 = 16;
pub const INTEGER_PACK_LSBYTE_FIRST: u32 = 32;
pub const INTEGER_PACK_NATIVE_BYTE_ORDER: u32 = 64;
pub const INTEGER_PACK_2COMP: u32 = 128;
pub const INTEGER_PACK_FORCE_GENERIC_IMPLEMENTATION: u32 = 1024;
pub const INTEGER_PACK_FORCE_BIGNUM: u32 = 256;
pub const INTEGER_PACK_NEGATIVE: u32 = 512;
pub const INTEGER_PACK_LITTLE_ENDIAN: u32 = 34;
pub const INTEGER_PACK_BIG_ENDIAN: u32 = 17;
pub const HAVE_RB_EXT_RACTOR_SAFE: u32 = 1;
pub const RB_NUM_COERCE_FUNCS_NEED_OPID: u32 = 1;
pub const HAVE_RB_REG_NEW_STR: u32 = 1;
pub const RUBY_VM: u32 = 1;
pub const RUBY_SUBST_H: u32 = 1;
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
pub type off_t = ::std::os::raw::c_longlong;
pub type time_t = ::std::os::raw::c_longlong;
pub type suseconds_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: time_t,
    pub tv_usec: suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    const UNINIT: ::std::mem::MaybeUninit<timeval> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: time_t,
    pub tv_nsec: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::std::mem::MaybeUninit<timespec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    _unused: [u8; 0],
}
pub type FILE = _IO_FILE;
pub type __isoc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[test]
fn bindgen_test_layout_iovec() {
    const UNINIT: ::std::mem::MaybeUninit<iovec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iovec>(),
        8usize,
        concat!("Size of: ", stringify!(iovec))
    );
    assert_eq!(
        ::std::mem::align_of::<iovec>(),
        4usize,
        concat!("Alignment of ", stringify!(iovec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iov_base) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iovec),
            "::",
            stringify!(iov_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iov_len) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iovec),
            "::",
            stringify!(iov_len)
        )
    );
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    const UNINIT: ::std::mem::MaybeUninit<max_align_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = i8;
pub type int_fast64_t = i64;
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast64_t = u64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type __wasi_size_t = ::std::os::raw::c_ulong;
pub type __wasi_filesize_t = u64;
pub type __wasi_timestamp_t = u64;
pub type __wasi_clockid_t = u32;
pub type __wasi_errno_t = u16;
pub type __wasi_rights_t = u64;
pub type __wasi_fd_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wasi_iovec_t {
    pub buf: *mut u8,
    pub buf_len: __wasi_size_t,
}
#[test]
fn bindgen_test_layout___wasi_iovec_t() {
    const UNINIT: ::std::mem::MaybeUninit<__wasi_iovec_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__wasi_iovec_t>(),
        8usize,
        concat!("Size of: ", stringify!(__wasi_iovec_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__wasi_iovec_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__wasi_iovec_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_iovec_t),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buf_len) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_iovec_t),
            "::",
            stringify!(buf_len)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wasi_ciovec_t {
    pub buf: *const u8,
    pub buf_len: __wasi_size_t,
}
#[test]
fn bindgen_test_layout___wasi_ciovec_t() {
    const UNINIT: ::std::mem::MaybeUninit<__wasi_ciovec_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__wasi_ciovec_t>(),
        8usize,
        concat!("Size of: ", stringify!(__wasi_ciovec_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__wasi_ciovec_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__wasi_ciovec_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_ciovec_t),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buf_len) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_ciovec_t),
            "::",
            stringify!(buf_len)
        )
    );
}
pub type __wasi_filedelta_t = i64;
pub type __wasi_whence_t = u8;
pub type __wasi_dircookie_t = u64;
pub type __wasi_dirnamlen_t = u32;
pub type __wasi_inode_t = u64;
pub type __wasi_filetype_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wasi_dirent_t {
    pub d_next: __wasi_dircookie_t,
    pub d_ino: __wasi_inode_t,
    pub d_namlen: __wasi_dirnamlen_t,
    pub d_type: __wasi_filetype_t,
}
#[test]
fn bindgen_test_layout___wasi_dirent_t() {
    const UNINIT: ::std::mem::MaybeUninit<__wasi_dirent_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__wasi_dirent_t>(),
        24usize,
        concat!("Size of: ", stringify!(__wasi_dirent_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__wasi_dirent_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__wasi_dirent_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_dirent_t),
            "::",
            stringify!(d_next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_ino) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_dirent_t),
            "::",
            stringify!(d_ino)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_namlen) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_dirent_t),
            "::",
            stringify!(d_namlen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_type) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_dirent_t),
            "::",
            stringify!(d_type)
        )
    );
}
pub type __wasi_advice_t = u8;
pub type __wasi_fdflags_t = u16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wasi_fdstat_t {
    pub fs_filetype: __wasi_filetype_t,
    pub fs_flags: __wasi_fdflags_t,
    pub fs_rights_base: __wasi_rights_t,
    pub fs_rights_inheriting: __wasi_rights_t,
}
#[test]
fn bindgen_test_layout___wasi_fdstat_t() {
    const UNINIT: ::std::mem::MaybeUninit<__wasi_fdstat_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__wasi_fdstat_t>(),
        24usize,
        concat!("Size of: ", stringify!(__wasi_fdstat_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__wasi_fdstat_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__wasi_fdstat_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fs_filetype) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_fdstat_t),
            "::",
            stringify!(fs_filetype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fs_flags) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_fdstat_t),
            "::",
            stringify!(fs_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fs_rights_base) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_fdstat_t),
            "::",
            stringify!(fs_rights_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fs_rights_inheriting) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_fdstat_t),
            "::",
            stringify!(fs_rights_inheriting)
        )
    );
}
pub type __wasi_device_t = u64;
pub type __wasi_fstflags_t = u16;
pub type __wasi_lookupflags_t = u32;
pub type __wasi_oflags_t = u16;
pub type __wasi_linkcount_t = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wasi_filestat_t {
    pub dev: __wasi_device_t,
    pub ino: __wasi_inode_t,
    pub filetype: __wasi_filetype_t,
    pub nlink: __wasi_linkcount_t,
    pub size: __wasi_filesize_t,
    pub atim: __wasi_timestamp_t,
    pub mtim: __wasi_timestamp_t,
    pub ctim: __wasi_timestamp_t,
}
#[test]
fn bindgen_test_layout___wasi_filestat_t() {
    const UNINIT: ::std::mem::MaybeUninit<__wasi_filestat_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__wasi_filestat_t>(),
        64usize,
        concat!("Size of: ", stringify!(__wasi_filestat_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__wasi_filestat_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__wasi_filestat_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_filestat_t),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ino) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_filestat_t),
            "::",
            stringify!(ino)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).filetype) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_filestat_t),
            "::",
            stringify!(filetype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nlink) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_filestat_t),
            "::",
            stringify!(nlink)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_filestat_t),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).atim) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_filestat_t),
            "::",
            stringify!(atim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mtim) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_filestat_t),
            "::",
            stringify!(mtim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctim) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_filestat_t),
            "::",
            stringify!(ctim)
        )
    );
}
pub type __wasi_userdata_t = u64;
pub type __wasi_eventtype_t = u8;
pub type __wasi_eventrwflags_t = u16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wasi_event_fd_readwrite_t {
    pub nbytes: __wasi_filesize_t,
    pub flags: __wasi_eventrwflags_t,
}
#[test]
fn bindgen_test_layout___wasi_event_fd_readwrite_t() {
    const UNINIT: ::std::mem::MaybeUninit<__wasi_event_fd_readwrite_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__wasi_event_fd_readwrite_t>(),
        16usize,
        concat!("Size of: ", stringify!(__wasi_event_fd_readwrite_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__wasi_event_fd_readwrite_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__wasi_event_fd_readwrite_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nbytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_event_fd_readwrite_t),
            "::",
            stringify!(nbytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_event_fd_readwrite_t),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wasi_event_t {
    pub userdata: __wasi_userdata_t,
    pub error: __wasi_errno_t,
    pub type_: __wasi_eventtype_t,
    pub fd_readwrite: __wasi_event_fd_readwrite_t,
}
#[test]
fn bindgen_test_layout___wasi_event_t() {
    const UNINIT: ::std::mem::MaybeUninit<__wasi_event_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__wasi_event_t>(),
        32usize,
        concat!("Size of: ", stringify!(__wasi_event_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__wasi_event_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__wasi_event_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).userdata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_event_t),
            "::",
            stringify!(userdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).error) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_event_t),
            "::",
            stringify!(error)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_event_t),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fd_readwrite) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_event_t),
            "::",
            stringify!(fd_readwrite)
        )
    );
}
pub type __wasi_subclockflags_t = u16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wasi_subscription_clock_t {
    pub id: __wasi_clockid_t,
    pub timeout: __wasi_timestamp_t,
    pub precision: __wasi_timestamp_t,
    pub flags: __wasi_subclockflags_t,
}
#[test]
fn bindgen_test_layout___wasi_subscription_clock_t() {
    const UNINIT: ::std::mem::MaybeUninit<__wasi_subscription_clock_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__wasi_subscription_clock_t>(),
        32usize,
        concat!("Size of: ", stringify!(__wasi_subscription_clock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__wasi_subscription_clock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__wasi_subscription_clock_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_subscription_clock_t),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeout) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_subscription_clock_t),
            "::",
            stringify!(timeout)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).precision) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_subscription_clock_t),
            "::",
            stringify!(precision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_subscription_clock_t),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wasi_subscription_fd_readwrite_t {
    pub file_descriptor: __wasi_fd_t,
}
#[test]
fn bindgen_test_layout___wasi_subscription_fd_readwrite_t() {
    const UNINIT: ::std::mem::MaybeUninit<__wasi_subscription_fd_readwrite_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__wasi_subscription_fd_readwrite_t>(),
        4usize,
        concat!("Size of: ", stringify!(__wasi_subscription_fd_readwrite_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__wasi_subscription_fd_readwrite_t>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__wasi_subscription_fd_readwrite_t)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).file_descriptor) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_subscription_fd_readwrite_t),
            "::",
            stringify!(file_descriptor)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __wasi_subscription_u_u_t {
    pub clock: __wasi_subscription_clock_t,
    pub fd_read: __wasi_subscription_fd_readwrite_t,
    pub fd_write: __wasi_subscription_fd_readwrite_t,
}
#[test]
fn bindgen_test_layout___wasi_subscription_u_u_t() {
    const UNINIT: ::std::mem::MaybeUninit<__wasi_subscription_u_u_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__wasi_subscription_u_u_t>(),
        32usize,
        concat!("Size of: ", stringify!(__wasi_subscription_u_u_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__wasi_subscription_u_u_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__wasi_subscription_u_u_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clock) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_subscription_u_u_t),
            "::",
            stringify!(clock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fd_read) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_subscription_u_u_t),
            "::",
            stringify!(fd_read)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fd_write) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_subscription_u_u_t),
            "::",
            stringify!(fd_write)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __wasi_subscription_u_t {
    pub tag: __wasi_eventtype_t,
    pub u: __wasi_subscription_u_u_t,
}
#[test]
fn bindgen_test_layout___wasi_subscription_u_t() {
    const UNINIT: ::std::mem::MaybeUninit<__wasi_subscription_u_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__wasi_subscription_u_t>(),
        40usize,
        concat!("Size of: ", stringify!(__wasi_subscription_u_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__wasi_subscription_u_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__wasi_subscription_u_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tag) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_subscription_u_t),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_subscription_u_t),
            "::",
            stringify!(u)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __wasi_subscription_t {
    pub userdata: __wasi_userdata_t,
    pub u: __wasi_subscription_u_t,
}
#[test]
fn bindgen_test_layout___wasi_subscription_t() {
    const UNINIT: ::std::mem::MaybeUninit<__wasi_subscription_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__wasi_subscription_t>(),
        48usize,
        concat!("Size of: ", stringify!(__wasi_subscription_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__wasi_subscription_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__wasi_subscription_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).userdata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_subscription_t),
            "::",
            stringify!(userdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_subscription_t),
            "::",
            stringify!(u)
        )
    );
}
pub type __wasi_exitcode_t = u32;
pub type __wasi_signal_t = u8;
pub type __wasi_riflags_t = u16;
pub type __wasi_roflags_t = u16;
pub type __wasi_siflags_t = u16;
pub type __wasi_sdflags_t = u8;
pub type __wasi_preopentype_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __wasi_prestat_dir_t {
    pub pr_name_len: __wasi_size_t,
}
#[test]
fn bindgen_test_layout___wasi_prestat_dir_t() {
    const UNINIT: ::std::mem::MaybeUninit<__wasi_prestat_dir_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__wasi_prestat_dir_t>(),
        4usize,
        concat!("Size of: ", stringify!(__wasi_prestat_dir_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__wasi_prestat_dir_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__wasi_prestat_dir_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pr_name_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_prestat_dir_t),
            "::",
            stringify!(pr_name_len)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __wasi_prestat_u_t {
    pub dir: __wasi_prestat_dir_t,
}
#[test]
fn bindgen_test_layout___wasi_prestat_u_t() {
    const UNINIT: ::std::mem::MaybeUninit<__wasi_prestat_u_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__wasi_prestat_u_t>(),
        4usize,
        concat!("Size of: ", stringify!(__wasi_prestat_u_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__wasi_prestat_u_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__wasi_prestat_u_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dir) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_prestat_u_t),
            "::",
            stringify!(dir)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __wasi_prestat_t {
    pub tag: __wasi_preopentype_t,
    pub u: __wasi_prestat_u_t,
}
#[test]
fn bindgen_test_layout___wasi_prestat_t() {
    const UNINIT: ::std::mem::MaybeUninit<__wasi_prestat_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__wasi_prestat_t>(),
        8usize,
        concat!("Size of: ", stringify!(__wasi_prestat_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__wasi_prestat_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__wasi_prestat_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tag) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_prestat_t),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__wasi_prestat_t),
            "::",
            stringify!(u)
        )
    );
}
extern "C" {
    pub fn __wasi_args_get(argv: *mut *mut u8, argv_buf: *mut u8) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_args_sizes_get(
        argc: *mut __wasi_size_t,
        argv_buf_size: *mut __wasi_size_t,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_environ_get(environ: *mut *mut u8, environ_buf: *mut u8) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_environ_sizes_get(
        environc: *mut __wasi_size_t,
        environ_buf_size: *mut __wasi_size_t,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_clock_res_get(
        id: __wasi_clockid_t,
        resolution: *mut __wasi_timestamp_t,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_clock_time_get(
        id: __wasi_clockid_t,
        precision: __wasi_timestamp_t,
        time: *mut __wasi_timestamp_t,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_fd_advise(
        fd: __wasi_fd_t,
        offset: __wasi_filesize_t,
        len: __wasi_filesize_t,
        advice: __wasi_advice_t,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_fd_allocate(
        fd: __wasi_fd_t,
        offset: __wasi_filesize_t,
        len: __wasi_filesize_t,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_fd_close(fd: __wasi_fd_t) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_fd_datasync(fd: __wasi_fd_t) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_fd_fdstat_get(fd: __wasi_fd_t, stat: *mut __wasi_fdstat_t) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_fd_fdstat_set_flags(fd: __wasi_fd_t, flags: __wasi_fdflags_t) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_fd_fdstat_set_rights(
        fd: __wasi_fd_t,
        fs_rights_base: __wasi_rights_t,
        fs_rights_inheriting: __wasi_rights_t,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_fd_filestat_get(fd: __wasi_fd_t, buf: *mut __wasi_filestat_t) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_fd_filestat_set_size(fd: __wasi_fd_t, size: __wasi_filesize_t) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_fd_filestat_set_times(
        fd: __wasi_fd_t,
        atim: __wasi_timestamp_t,
        mtim: __wasi_timestamp_t,
        fst_flags: __wasi_fstflags_t,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_fd_pread(
        fd: __wasi_fd_t,
        iovs: *const __wasi_iovec_t,
        iovs_len: usize,
        offset: __wasi_filesize_t,
        nread: *mut __wasi_size_t,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_fd_prestat_get(fd: __wasi_fd_t, buf: *mut __wasi_prestat_t) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_fd_prestat_dir_name(
        fd: __wasi_fd_t,
        path: *mut u8,
        path_len: __wasi_size_t,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_fd_pwrite(
        fd: __wasi_fd_t,
        iovs: *const __wasi_ciovec_t,
        iovs_len: usize,
        offset: __wasi_filesize_t,
        nwritten: *mut __wasi_size_t,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_fd_read(
        fd: __wasi_fd_t,
        iovs: *const __wasi_iovec_t,
        iovs_len: usize,
        nread: *mut __wasi_size_t,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_fd_readdir(
        fd: __wasi_fd_t,
        buf: *mut u8,
        buf_len: __wasi_size_t,
        cookie: __wasi_dircookie_t,
        bufused: *mut __wasi_size_t,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_fd_renumber(fd: __wasi_fd_t, to: __wasi_fd_t) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_fd_seek(
        fd: __wasi_fd_t,
        offset: __wasi_filedelta_t,
        whence: __wasi_whence_t,
        newoffset: *mut __wasi_filesize_t,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_fd_sync(fd: __wasi_fd_t) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_fd_tell(fd: __wasi_fd_t, offset: *mut __wasi_filesize_t) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_fd_write(
        fd: __wasi_fd_t,
        iovs: *const __wasi_ciovec_t,
        iovs_len: usize,
        nwritten: *mut __wasi_size_t,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_path_create_directory(
        fd: __wasi_fd_t,
        path: *const ::std::os::raw::c_char,
        path_len: usize,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_path_filestat_get(
        fd: __wasi_fd_t,
        flags: __wasi_lookupflags_t,
        path: *const ::std::os::raw::c_char,
        path_len: usize,
        buf: *mut __wasi_filestat_t,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_path_filestat_set_times(
        fd: __wasi_fd_t,
        flags: __wasi_lookupflags_t,
        path: *const ::std::os::raw::c_char,
        path_len: usize,
        atim: __wasi_timestamp_t,
        mtim: __wasi_timestamp_t,
        fst_flags: __wasi_fstflags_t,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_path_link(
        old_fd: __wasi_fd_t,
        old_flags: __wasi_lookupflags_t,
        old_path: *const ::std::os::raw::c_char,
        old_path_len: usize,
        new_fd: __wasi_fd_t,
        new_path: *const ::std::os::raw::c_char,
        new_path_len: usize,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_path_open(
        fd: __wasi_fd_t,
        dirflags: __wasi_lookupflags_t,
        path: *const ::std::os::raw::c_char,
        path_len: usize,
        oflags: __wasi_oflags_t,
        fs_rights_base: __wasi_rights_t,
        fs_rights_inherting: __wasi_rights_t,
        fdflags: __wasi_fdflags_t,
        opened_fd: *mut __wasi_fd_t,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_path_readlink(
        fd: __wasi_fd_t,
        path: *const ::std::os::raw::c_char,
        path_len: usize,
        buf: *mut u8,
        buf_len: __wasi_size_t,
        bufused: *mut __wasi_size_t,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_path_remove_directory(
        fd: __wasi_fd_t,
        path: *const ::std::os::raw::c_char,
        path_len: usize,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_path_rename(
        fd: __wasi_fd_t,
        old_path: *const ::std::os::raw::c_char,
        old_path_len: usize,
        new_fd: __wasi_fd_t,
        new_path: *const ::std::os::raw::c_char,
        new_path_len: usize,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_path_symlink(
        old_path: *const ::std::os::raw::c_char,
        old_path_len: usize,
        fd: __wasi_fd_t,
        new_path: *const ::std::os::raw::c_char,
        new_path_len: usize,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_path_unlink_file(
        fd: __wasi_fd_t,
        path: *const ::std::os::raw::c_char,
        path_len: usize,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_poll_oneoff(
        in_: *const __wasi_subscription_t,
        out: *mut __wasi_event_t,
        nsubscriptions: __wasi_size_t,
        nevents: *mut __wasi_size_t,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_proc_exit(rval: __wasi_exitcode_t);
}
extern "C" {
    pub fn __wasi_proc_raise(sig: __wasi_signal_t) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_sched_yield() -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_random_get(buf: *mut u8, buf_len: __wasi_size_t) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_sock_recv(
        fd: __wasi_fd_t,
        ri_data: *const __wasi_iovec_t,
        ri_data_len: usize,
        ri_flags: __wasi_riflags_t,
        ro_datalen: *mut __wasi_size_t,
        ro_flags: *mut __wasi_roflags_t,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_sock_send(
        fd: __wasi_fd_t,
        si_data: *const __wasi_ciovec_t,
        si_data_len: usize,
        si_flags: __wasi_siflags_t,
        so_datalen: *mut __wasi_size_t,
    ) -> __wasi_errno_t;
}
extern "C" {
    pub fn __wasi_sock_shutdown(fd: __wasi_fd_t, how: __wasi_sdflags_t) -> __wasi_errno_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _G_fpos64_t {
    pub __opaque: [::std::os::raw::c_char; 16usize],
    pub __lldata: ::std::os::raw::c_longlong,
    pub __align: f64,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    const UNINIT: ::std::mem::MaybeUninit<_G_fpos64_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__opaque)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__lldata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__lldata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type fpos_t = _G_fpos64_t;
extern "C" {
    pub static stdin: *mut FILE;
}
extern "C" {
    pub static stdout: *mut FILE;
}
extern "C" {
    pub static stderr: *mut FILE;
}
extern "C" {
    pub fn fopen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn remove(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn feof(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(arg1: *mut FILE);
}
extern "C" {
    pub fn fseek(
        arg1: *mut FILE,
        arg2: ::std::os::raw::c_long,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(arg1: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(arg1: *mut FILE);
}
extern "C" {
    pub fn fgetpos(arg1: *mut FILE, arg2: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(arg1: *mut FILE, arg2: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        arg1: *mut ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_ulong,
        arg3: ::std::os::raw::c_ulong,
        arg4: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fwrite(
        arg1: *const ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_ulong,
        arg3: ::std::os::raw::c_ulong,
        arg4: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fgetc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fputs(arg1: *const ::std::os::raw::c_char, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_ulong,
        arg3: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        arg1: *const ::std::os::raw::c_char,
        arg2: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_ulong,
        arg3: *const ::std::os::raw::c_char,
        arg4: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        arg1: *mut FILE,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuf(arg1: *mut FILE, arg2: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        arg1: *mut ::std::os::raw::c_void,
        arg2: usize,
        arg3: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(arg1: *mut *mut ::std::os::raw::c_char, arg2: *mut usize) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(arg1: ::std::os::raw::c_int, arg2: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fileno(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fseeko(
        arg1: *mut FILE,
        arg2: off_t,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(arg1: *mut FILE) -> off_t;
}
extern "C" {
    pub fn dprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: __isoc_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getdelim(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *mut usize,
        arg3: ::std::os::raw::c_int,
        arg4: *mut FILE,
    ) -> isize;
}
extern "C" {
    pub fn getline(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *mut usize,
        arg3: *mut FILE,
    ) -> isize;
}
extern "C" {
    pub fn renameat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn cuserid(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setlinebuf(arg1: *mut FILE);
}
extern "C" {
    pub fn setbuffer(arg1: *mut FILE, arg2: *mut ::std::os::raw::c_char, arg3: usize);
}
extern "C" {
    pub fn fgetc_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread_unlocked(
        arg1: *mut ::std::os::raw::c_void,
        arg2: usize,
        arg3: usize,
        arg4: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(
        arg1: *const ::std::os::raw::c_void,
        arg2: usize,
        arg3: usize,
        arg4: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn clearerr_unlocked(arg1: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetln(arg1: *mut FILE, arg2: *mut usize) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn asprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vasprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: __isoc_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets_unlocked(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fputs_unlocked(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
pub type cookie_read_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_char,
        arg3: usize,
    ) -> isize,
>;
pub type cookie_write_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_char,
        arg3: usize,
    ) -> isize,
>;
pub type cookie_seek_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut off_t,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type cookie_close_function_t = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_cookie_io_functions_t {
    pub read: cookie_read_function_t,
    pub write: cookie_write_function_t,
    pub seek: cookie_seek_function_t,
    pub close: cookie_close_function_t,
}
#[test]
fn bindgen_test_layout__IO_cookie_io_functions_t() {
    const UNINIT: ::std::mem::MaybeUninit<_IO_cookie_io_functions_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_IO_cookie_io_functions_t>(),
        16usize,
        concat!("Size of: ", stringify!(_IO_cookie_io_functions_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_cookie_io_functions_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_IO_cookie_io_functions_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).read) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).write) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seek) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(seek)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).close) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(close)
        )
    );
}
pub type cookie_io_functions_t = _IO_cookie_io_functions_t;
extern "C" {
    pub fn fopencookie(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_char,
        arg3: cookie_io_functions_t,
    ) -> *mut FILE;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __clockid {
    _unused: [u8; 0],
}
pub type clockid_t = *const __clockid;
pub type clock_t = ::std::os::raw::c_longlong;
pub type register_t = ::std::os::raw::c_longlong;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type mode_t = ::std::os::raw::c_uint;
pub type nlink_t = ::std::os::raw::c_ulonglong;
pub type ino_t = ::std::os::raw::c_ulonglong;
pub type dev_t = ::std::os::raw::c_ulonglong;
pub type blksize_t = ::std::os::raw::c_long;
pub type blkcnt_t = ::std::os::raw::c_longlong;
pub type fsblkcnt_t = ::std::os::raw::c_ulonglong;
pub type fsfilcnt_t = ::std::os::raw::c_ulonglong;
pub type timer_t = *mut ::std::os::raw::c_void;
pub type pid_t = ::std::os::raw::c_int;
pub type id_t = ::std::os::raw::c_uint;
pub type uid_t = ::std::os::raw::c_uint;
pub type gid_t = ::std::os::raw::c_uint;
pub type key_t = ::std::os::raw::c_int;
pub type useconds_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread {
    _unused: [u8; 0],
}
pub type pthread_t = *mut __pthread;
pub type pthread_once_t = ::std::os::raw::c_int;
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_mutexattr_t {
    pub __attr: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutexattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__attr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__attr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_condattr_t {
    pub __attr: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_condattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__attr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__attr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_barrierattr_t {
    pub __attr: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_barrierattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__attr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__attr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_rwlockattr_t {
    pub __attr: [::std::os::raw::c_uint; 2usize],
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_rwlockattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__attr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__attr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pthread_attr_t {
    pub __u: pthread_attr_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t__bindgen_ty_1 {
    pub __i: [::std::os::raw::c_int; 9usize],
    pub __vi: [::std::os::raw::c_int; 9usize],
    pub __s: [::std::os::raw::c_ulong; 9usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_attr_t__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t__bindgen_ty_1>(),
        36usize,
        concat!("Size of: ", stringify!(pthread_attr_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_attr_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__i) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t__bindgen_ty_1),
            "::",
            stringify!(__i)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__vi) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t__bindgen_ty_1),
            "::",
            stringify!(__vi)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__s) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t__bindgen_ty_1),
            "::",
            stringify!(__s)
        )
    );
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_attr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        36usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__u) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__u)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pthread_mutex_t {
    pub __u: pthread_mutex_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t__bindgen_ty_1 {
    pub __i: [::std::os::raw::c_int; 6usize],
    pub __vi: [::std::os::raw::c_int; 6usize],
    pub __p: [*mut ::std::os::raw::c_void; 6usize],
}
#[test]
fn bindgen_test_layout_pthread_mutex_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutex_t__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(pthread_mutex_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__i) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t__bindgen_ty_1),
            "::",
            stringify!(__i)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__vi) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t__bindgen_ty_1),
            "::",
            stringify!(__vi)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__p) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t__bindgen_ty_1),
            "::",
            stringify!(__p)
        )
    );
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutex_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        24usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__u) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__u)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pthread_cond_t {
    pub __u: pthread_cond_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t__bindgen_ty_1 {
    pub __i: [::std::os::raw::c_int; 12usize],
    pub __vi: [::std::os::raw::c_int; 12usize],
    pub __p: [*mut ::std::os::raw::c_void; 12usize],
}
#[test]
fn bindgen_test_layout_pthread_cond_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_cond_t__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t__bindgen_ty_1>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_cond_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__i) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__i)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__vi) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__vi)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__p) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__p)
        )
    );
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_cond_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__u) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__u)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pthread_rwlock_t {
    pub __u: pthread_rwlock_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t__bindgen_ty_1 {
    pub __i: [::std::os::raw::c_int; 8usize],
    pub __vi: [::std::os::raw::c_int; 8usize],
    pub __p: [*mut ::std::os::raw::c_void; 8usize],
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_rwlock_t__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t__bindgen_ty_1>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__i) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__i)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__vi) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__vi)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__p) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__p)
        )
    );
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_rwlock_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__u) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__u)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pthread_barrier_t {
    pub __u: pthread_barrier_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t__bindgen_ty_1 {
    pub __i: [::std::os::raw::c_int; 5usize],
    pub __vi: [::std::os::raw::c_int; 5usize],
    pub __p: [*mut ::std::os::raw::c_void; 5usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_barrier_t__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t__bindgen_ty_1>(),
        20usize,
        concat!("Size of: ", stringify!(pthread_barrier_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__i) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t__bindgen_ty_1),
            "::",
            stringify!(__i)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__vi) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t__bindgen_ty_1),
            "::",
            stringify!(__vi)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__p) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t__bindgen_ty_1),
            "::",
            stringify!(__p)
        )
    );
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_barrier_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        20usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__u) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__u)
        )
    );
}
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type caddr_t = *mut ::std::os::raw::c_char;
pub type u_char = ::std::os::raw::c_uchar;
pub type u_short = ::std::os::raw::c_ushort;
pub type ushort = ::std::os::raw::c_ushort;
pub type u_int = ::std::os::raw::c_uint;
pub type uint = ::std::os::raw::c_uint;
pub type u_long = ::std::os::raw::c_ulong;
pub type ulong = ::std::os::raw::c_ulong;
pub type quad_t = ::std::os::raw::c_longlong;
pub type u_quad_t = ::std::os::raw::c_ulonglong;
pub type sigset_t = ::std::os::raw::c_uchar;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __nfds: usize,
    pub __fds: [::std::os::raw::c_int; 1024usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    const UNINIT: ::std::mem::MaybeUninit<fd_set> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        4100usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        4usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__nfds) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__nfds)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__fds) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds)
        )
    );
}
extern "C" {
    pub fn select(
        arg1: ::std::os::raw::c_int,
        arg2: *mut fd_set,
        arg3: *mut fd_set,
        arg4: *mut fd_set,
        arg5: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        arg1: ::std::os::raw::c_int,
        arg2: *mut fd_set,
        arg3: *mut fd_set,
        arg4: *mut fd_set,
        arg5: *const timespec,
        arg6: *const sigset_t,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stat {
    pub st_dev: dev_t,
    pub st_ino: ino_t,
    pub st_nlink: nlink_t,
    pub st_mode: mode_t,
    pub st_uid: uid_t,
    pub st_gid: gid_t,
    pub __pad0: ::std::os::raw::c_uint,
    pub st_rdev: dev_t,
    pub st_size: off_t,
    pub st_blksize: blksize_t,
    pub st_blocks: blkcnt_t,
    pub st_atim: timespec,
    pub st_mtim: timespec,
    pub st_ctim: timespec,
    pub __reserved: [::std::os::raw::c_longlong; 3usize],
}
#[test]
fn bindgen_test_layout_stat() {
    const UNINIT: ::std::mem::MaybeUninit<stat> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<stat>(),
        144usize,
        concat!("Size of: ", stringify!(stat))
    );
    assert_eq!(
        ::std::mem::align_of::<stat>(),
        8usize,
        concat!("Alignment of ", stringify!(stat))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_dev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_dev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_ino) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_ino)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_nlink) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_nlink)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_mode) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_uid) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_uid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_gid) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_gid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad0) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(__pad0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_rdev) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_rdev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_size) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_blksize) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_blksize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_blocks) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_blocks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_atim) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_atim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_mtim) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_mtim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_ctim) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(st_ctim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__reserved) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(__reserved)
        )
    );
}
extern "C" {
    pub fn stat(arg1: *const ::std::os::raw::c_char, arg2: *mut stat) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fstat(arg1: ::std::os::raw::c_int, arg2: *mut stat) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lstat(arg1: *const ::std::os::raw::c_char, arg2: *mut stat) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fstatat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut stat,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdir(arg1: *const ::std::os::raw::c_char, arg2: mode_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdirat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: mode_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn futimens(arg1: ::std::os::raw::c_int, arg2: *const timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn utimensat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const timespec,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn malloc(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn calloc(
        __nmemb: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abort() -> !;
}
extern "C" {
    pub fn qsort(
        arg1: *mut ::std::os::raw::c_void,
        arg2: usize,
        arg3: usize,
        arg4: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
extern "C" {
    pub fn _Exit(arg1: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn atoi(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn atof(arg1: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn strtof(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
extern "C" {
    pub fn strtod(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtold(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
extern "C" {
    pub fn strtol(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoll(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand(arg1: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn aligned_alloc(
        arg1: ::std::os::raw::c_ulong,
        arg2: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn atexit(arg1: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exit(arg1: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn at_quick_exit(
        arg1: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn quick_exit(arg1: ::std::os::raw::c_int);
}
extern "C" {
    pub fn getenv(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn system(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bsearch(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: usize,
        arg4: usize,
        arg5: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abs(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(arg1: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(arg1: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    const UNINIT: ::std::mem::MaybeUninit<div_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::std::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<ldiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ldiv_t>(),
        8usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ldiv_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<lldiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn div(arg1: ::std::os::raw::c_int, arg2: ::std::os::raw::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(arg1: ::std::os::raw::c_long, arg2: ::std::os::raw::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(arg1: ::std::os::raw::c_longlong, arg2: ::std::os::raw::c_longlong) -> lldiv_t;
}
extern "C" {
    pub fn mblen(arg1: *const ::std::os::raw::c_char, arg2: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbtowc(
        arg1: *mut wchar_t,
        arg2: *const ::std::os::raw::c_char,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb(arg1: *mut ::std::os::raw::c_char, arg2: wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs(arg1: *mut wchar_t, arg2: *const ::std::os::raw::c_char, arg3: usize) -> usize;
}
extern "C" {
    pub fn wcstombs(arg1: *mut ::std::os::raw::c_char, arg2: *const wchar_t, arg3: usize) -> usize;
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
extern "C" {
    pub fn posix_memalign(
        arg1: *mut *mut ::std::os::raw::c_void,
        arg2: usize,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setenv(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsubopt(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const *mut ::std::os::raw::c_char,
        arg3: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rand_r(arg1: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srandom(arg1: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn initstate(
        arg1: ::std::os::raw::c_uint,
        arg2: *mut ::std::os::raw::c_char,
        arg3: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setstate(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(arg1: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn l64a(arg1: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn a64l(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn setkey(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(arg1: *mut ::std::os::raw::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn nrand48(arg1: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn jrand48(arg1: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srand48(arg1: ::std::os::raw::c_long);
}
extern "C" {
    pub fn seed48(arg1: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn lcong48(arg1: *mut ::std::os::raw::c_ushort);
}
extern "C" {
    pub fn alloca(arg1: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ecvt(
        arg1: f64,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(
        arg1: f64,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(
        arg1: f64,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn secure_getenv(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    _unused: [u8; 0],
}
extern "C" {
    pub fn strtof_l(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: *mut __locale_struct,
    ) -> f32;
}
extern "C" {
    pub fn strtod_l(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: *mut __locale_struct,
    ) -> f64;
}
extern "C" {
    pub fn strtold_l(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: *mut __locale_struct,
    ) -> u128;
}
extern "C" {
    pub fn arc4random() -> u32;
}
extern "C" {
    pub fn arc4random_buf(arg1: *mut ::std::os::raw::c_void, arg2: usize);
}
extern "C" {
    pub fn arc4random_uniform(arg1: u32) -> u32;
}
extern "C" {
    pub fn memcpy(
        __dst: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(
        __dst: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(
        __dst: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strlen(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strdup(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memchr(
        arg1: *const ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
pub type locale_t = *mut __locale_struct;
extern "C" {
    pub fn memcmp(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcpy(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncpy(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcat(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncat(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncmp(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcoll(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strchr(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcspn(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strspn(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strpbrk(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstr(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strerror(arg1: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn bcmp(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bcopy(
        arg1: *const ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
        arg3: usize,
    );
}
extern "C" {
    pub fn bzero(arg1: *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn index(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn rindex(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ffs(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsl(arg1: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsll(arg1: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp_l(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp_l(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: usize,
        arg4: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strtok_r(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strerror_r(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_char,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn stpcpy(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpncpy(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strnlen(arg1: *const ::std::os::raw::c_char, arg2: usize) -> usize;
}
extern "C" {
    pub fn strndup(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strsignal(arg1: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strerror_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcoll_l(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm_l(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: usize,
        arg4: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn memccpy(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strsep(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strlcat(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strlcpy(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn explicit_bzero(arg1: *mut ::std::os::raw::c_void, arg2: usize);
}
extern "C" {
    pub fn strverscmp(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strchrnul(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcasestr(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn memmem(
        arg1: *const ::std::os::raw::c_void,
        arg2: usize,
        arg3: *const ::std::os::raw::c_void,
        arg4: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memrchr(
        arg1: *const ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_int,
        arg3: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn mempcpy(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: intmax_t,
    pub rem: intmax_t,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<imaxdiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn imaxabs(arg1: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(arg1: intmax_t, arg2: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        arg1: *const wchar_t,
        arg2: *mut *mut wchar_t,
        arg3: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        arg1: *const wchar_t,
        arg2: *mut *mut wchar_t,
        arg3: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn close(fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn faccessat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn openat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sbrk(increment: isize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn posix_close(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lseek(arg1: ::std::os::raw::c_int, arg2: off_t, arg3: ::std::os::raw::c_int) -> off_t;
}
extern "C" {
    pub fn __wasilibc_tell(arg1: ::std::os::raw::c_int) -> off_t;
}
extern "C" {
    pub fn fsync(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fdatasync(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn read(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_void,
        arg3: usize,
    ) -> isize;
}
extern "C" {
    pub fn write(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_void,
        arg3: usize,
    ) -> isize;
}
extern "C" {
    pub fn pread(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_void,
        arg3: usize,
        arg4: off_t,
    ) -> isize;
}
extern "C" {
    pub fn pwrite(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_void,
        arg3: usize,
        arg4: off_t,
    ) -> isize;
}
extern "C" {
    pub fn link(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn linkat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn symlink(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn symlinkat(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn readlink(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut ::std::os::raw::c_char,
        arg3: usize,
    ) -> isize;
}
extern "C" {
    pub fn readlinkat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut ::std::os::raw::c_char,
        arg4: usize,
    ) -> isize;
}
extern "C" {
    pub fn unlink(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unlinkat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rmdir(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn truncate(arg1: *const ::std::os::raw::c_char, arg2: off_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftruncate(arg1: ::std::os::raw::c_int, arg2: off_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn access(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn chdir(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getcwd(arg1: *mut ::std::os::raw::c_char, arg2: usize) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn sleep(arg1: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _exit(arg1: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn isatty(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getlogin() -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn getlogin_r(arg1: *mut ::std::os::raw::c_char, arg2: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gethostname(arg1: *mut ::std::os::raw::c_char, arg2: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getopt(
        arg1: ::std::os::raw::c_int,
        arg2: *const *mut ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub static mut optarg: *mut ::std::os::raw::c_char;
}
extern "C" {
    pub static mut optind: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut opterr: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut optopt: ::std::os::raw::c_int;
}
extern "C" {
    pub fn pathconf(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn fpathconf(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn sysconf(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn confstr(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_char,
        arg3: usize,
    ) -> usize;
}
extern "C" {
    pub fn gethostid() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn crypt(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn encrypt(arg1: *mut ::std::os::raw::c_char, arg2: ::std::os::raw::c_int);
}
extern "C" {
    pub fn swab(
        arg1: *const ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
        arg3: isize,
    );
}
extern "C" {
    pub fn usleep(arg1: ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ualarm(
        arg1: ::std::os::raw::c_uint,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn getentropy(arg1: *mut ::std::os::raw::c_void, arg2: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub static mut optreset: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut environ: *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Allocates a  storage instance.  It is  largely the same as  system malloc(),\n except:\n\n   - It raises Ruby exceptions instead of returning NULL, and\n   - In case of `ENOMEM` it tries to GC to make some room.\n\n @param[in]  size            Requested amount of memory.\n @exception  rb_eNoMemError  No space left for `size` bytes allocation.\n @return     A valid pointer  to an allocated storage instance;  which has at\n             least `size` bytes width, with appropriate alignment detected by\n             the underlying malloc() routine.\n @note       It doesn't return NULL.\n @note       Unlike some malloc() implementations, it allocates something and\n             returns a meaningful value even when `size` is equal to zero.\n @warning    The return  value shall  be invalidated  exactly once  by either\n             ruby_xfree(),  ruby_xrealloc(), or  ruby_xrealloc2().   It is  a\n             failure to pass it to system free(), because the system and Ruby\n             might or might not share the same malloc() implementation."]
    pub fn ruby_xmalloc(size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Identical to ruby_xmalloc(), except it allocates `nelems` * `elemsiz` bytes.\n This is needed  because the multiplication could integer  overflow.  On such\n situations  Ruby does  not try  to  allocate at  all but  raises Ruby  level\n exceptions  instead.  If  there  is  no integer  overflow  the behaviour  is\n exactly the same as `ruby_xmalloc(nelems*elemsiz)`.\n\n @param[in]  nelems          Number of elements.\n @param[in]  elemsiz         Size of an element.\n @exception  rb_eNoMemError  No space left for allocation.\n @exception  rb_eArgError    `nelems` * `elemsiz` would overflow.\n @return     A valid pointer  to an allocated storage instance;  which has at\n             least  `nelems`  *  `elemsiz`   bytes  width,  with  appropriate\n             alignment detected by the underlying malloc() routine.\n @note       It doesn't return NULL.\n @note       Unlike some malloc() implementations, it allocates something and\n             returns a  meaningful value even  when `nelems` or  `elemsiz` or\n             both are zero.\n @warning    The return  value shall  be invalidated  exactly once  by either\n             ruby_xfree(),  ruby_xrealloc(), or  ruby_xrealloc2().   It is  a\n             failure to pass it to system free(), because the system and Ruby\n             might or might not share the same malloc() implementation."]
    pub fn ruby_xmalloc2(nelems: usize, elemsiz: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Identical  to  ruby_xmalloc2(),  except  it returns  a  zero-filled  storage\n instance.  It  can also be  seen as  a routine identical  to ruby_xmalloc(),\n except it calls calloc() instead of malloc().\n\n @param[in]  nelems          Number of elements.\n @param[in]  elemsiz         Size of an element.\n @exception  rb_eNoMemError  No space left for allocation.\n @exception  rb_eArgError    `nelems` * `elemsiz` would overflow.\n @return     A valid pointer  to an allocated storage instance;  which has at\n             least  `nelems`  *  `elemsiz`   bytes  width,  with  appropriate\n             alignment detected by the underlying calloc() routine.\n @post       The returned storage instance is filled with zeros.\n @note       It doesn't return NULL.\n @note       Unlike some calloc() implementations, it allocates something and\n             returns a  meaningful value even  when `nelems` or  `elemsiz` or\n             both are zero.\n @warning    The return  value shall  be invalidated  exactly once  by either\n             ruby_xfree(),  ruby_xrealloc(), or  ruby_xrealloc2().   It is  a\n             failure to pass it to system free(), because the system and Ruby\n             might or might not share the same malloc() implementation."]
    pub fn ruby_xcalloc(nelems: usize, elemsiz: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Resize the storage instance.\n\n @param[in]  ptr             A valid  pointer to a storage  instance that was\n                             previously returned from either:\n                               - ruby_xmalloc(),\n                               - ruby_xmalloc2(),\n                               - ruby_xcalloc(),\n                               - ruby_xrealloc(), or\n                               - ruby_xrealloc2().\n @param[in]  newsiz          Requested new amount of memory.\n @exception  rb_eNoMemError  No space left for `newsiz` bytes allocation.\n @return     A  valid  pointer  to   a  (possibly  newly  allocated)  storage\n             instance;  which  has  at   least  `newsiz`  bytes  width,  with\n             appropriate  alignment  detected  by  the  underlying  realloc()\n             routine.\n @pre        The passed pointer must point  to a valid live storage instance.\n             It is a failure to pass an already freed pointer.\n @post       In  case the  function  returns the  passed  pointer as-is,  the\n             storage  instance that  the  pointer holds  is  either grown  or\n             shrunken  to have  at least  `newsiz` bytes.  Otherwise a  valid\n             pointer to a  newly allocated storage instance  is returned.  In\n             this  case  `ptr`  is  invalidated   as  if  it  was  passed  to\n             ruby_xfree().\n @note       It doesn't return NULL.\n @warning    Unlike some realloc() implementations,  passing zero to `newsiz`\n             is not the  same as calling ruby_xfree(),  because this function\n             never returns NULL.  Something meaningful still returns then.\n @warning    It is  a failure not to  check the return value.   Do not assume\n             anything on  it.  It could  be either identical to,  or distinct\n             form the passed argument.\n @warning    Do not  assume anything  on the alignment  of the  return value.\n             There is  no guarantee  that it  inherits the  passed argument's\n             one.\n @warning    The return  value shall  be invalidated  exactly once  by either\n             ruby_xfree(),  ruby_xrealloc(), or  ruby_xrealloc2().   It is  a\n             failure to pass it to system free(), because the system and Ruby\n             might or might not share the same malloc() implementation."]
    pub fn ruby_xrealloc(
        ptr: *mut ::std::os::raw::c_void,
        newsiz: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Identical to ruby_xrealloc(),  except it resizes the  given storage instance\n to `newelems` *  `newsiz` bytes.  This is needed  because the multiplication\n could integer overflow.   On such situations Ruby does not  try to touch the\n contents  of  argument pointer  at  all  but  raises Ruby  level  exceptions\n instead.  If there is no integer  overflow the behaviour is exactly the same\n as `ruby_xrealloc(ptr,nelems*elemsiz)`.\n\n This  is   roughly  the  same   as  reallocarray()  function   that  OpenBSD\n etc. provides, but also interacts with our GC.\n\n @param[in]  ptr             A valid  pointer to a storage  instance that was\n                             previously returned from either:\n                               - ruby_xmalloc(),\n                               - ruby_xmalloc2(),\n                               - ruby_xcalloc(),\n                               - ruby_xrealloc(), or\n                               - ruby_xrealloc2().\n @param[in]  newelems        Requested new number of elements.\n @param[in]  newsiz          Requested new size of each element.\n @exception  rb_eNoMemError  No space left for  allocation.\n @exception  rb_eArgError    `newelems` * `newsiz` would overflow.\n @return     A  valid  pointer  to   a  (possibly  newly  allocated)  storage\n             instance; which has at least  `newelems` * `newsiz` bytes width,\n             with appropriate alignment detected  by the underlying realloc()\n             routine.\n @pre        The passed pointer must point  to a valid live storage instance.\n             It is a failure to pass an already freed pointer.\n @post       In  case the  function  returns the  passed  pointer as-is,  the\n             storage  instance that  the  pointer holds  is  either grown  or\n             shrunken  to   have  at  least  `newelems`   *  `newsiz`  bytes.\n             Otherwise a valid pointer to  a newly allocated storage instance\n             is returned.   In this case  `ptr` is  invalidated as if  it was\n             passed to ruby_xfree().\n @note       It doesn't return NULL.\n @warning    Unlike some  realloc() implementations,  passing zero  to either\n             `newelems`   or  `elemsiz`   are   not  the   same  as   calling\n             ruby_xfree(),   because  this   function  never   returns  NULL.\n             Something meaningful still returns then.\n @warning    It is  a failure not to  check the return value.   Do not assume\n             anything on  it.  It could  be either identical to,  or distinct\n             form the passed argument.\n @warning    Do not  assume anything  on the alignment  of the  return value.\n             There is  no guarantee  that it  inherits the  passed argument's\n             one.\n @warning    The return  value shall  be invalidated  exactly once  by either\n             ruby_xfree(),  ruby_xrealloc(), or  ruby_xrealloc2().   It is  a\n             failure to pass it to system free(), because the system and Ruby\n             might or might not share the same malloc() implementation."]
    pub fn ruby_xrealloc2(
        ptr: *mut ::std::os::raw::c_void,
        newelems: usize,
        newsiz: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Deallocates a storage instance.\n\n @param[out]  ptr  Either\n                     - NULL, or\n                     - a valid pointer previously returned from one of:\n                       - ruby_xmalloc(),\n                       - ruby_xmalloc2(),\n                       - ruby_xcalloc(),\n                       - ruby_xrealloc(), or\n                       - ruby_xrealloc2().\n @pre         The passed pointer must point to a valid live storage instance.\n              It is a failure to pass an already freed pointer.\n @post        The  storage  instance  pointed  by  the  passed  pointer  gets\n              invalidated; it is no longer addressable.\n @warning     Every single storage instance  that was previously allocated by\n              either    ruby_xmalloc(),   ruby_xmalloc2(),    ruby_xcalloc(),\n              ruby_xrealloc(),  or  ruby_xrealloc2()   shall  be  invalidated\n              exactly once by  either passing it to  ruby_xfree(), or passing\n              it to  either ruby_xrealloc(), ruby_xrealloc2() then  check the\n              return value for invalidation.\n @warning     Do not pass anything other  than pointers described above.  For\n              instance pointers returned from malloc() or mmap() shall not be\n              passed  to   this  function,  because  the   underlying  memory\n              management mechanism could differ.\n @warning     Do  not pass  any invalid  pointers  to this  function e.g.  by\n              calling it twice with a same argument."]
    pub fn ruby_xfree(ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn rb_assert_failure(
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
        name: *const ::std::os::raw::c_char,
        expr: *const ::std::os::raw::c_char,
    ) -> !;
}
pub type float_t = f32;
pub type double_t = f64;
extern "C" {
    pub fn acos(arg1: f64) -> f64;
}
extern "C" {
    pub fn acosf(arg1: f32) -> f32;
}
extern "C" {
    pub fn acosl(arg1: u128) -> u128;
}
extern "C" {
    pub fn acosh(arg1: f64) -> f64;
}
extern "C" {
    pub fn acoshf(arg1: f32) -> f32;
}
extern "C" {
    pub fn acoshl(arg1: u128) -> u128;
}
extern "C" {
    pub fn asin(arg1: f64) -> f64;
}
extern "C" {
    pub fn asinf(arg1: f32) -> f32;
}
extern "C" {
    pub fn asinl(arg1: u128) -> u128;
}
extern "C" {
    pub fn asinh(arg1: f64) -> f64;
}
extern "C" {
    pub fn asinhf(arg1: f32) -> f32;
}
extern "C" {
    pub fn asinhl(arg1: u128) -> u128;
}
extern "C" {
    pub fn atan(arg1: f64) -> f64;
}
extern "C" {
    pub fn atanf(arg1: f32) -> f32;
}
extern "C" {
    pub fn atanl(arg1: u128) -> u128;
}
extern "C" {
    pub fn atan2(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn atan2f(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn atan2l(arg1: u128, arg2: u128) -> u128;
}
extern "C" {
    pub fn atanh(arg1: f64) -> f64;
}
extern "C" {
    pub fn atanhf(arg1: f32) -> f32;
}
extern "C" {
    pub fn atanhl(arg1: u128) -> u128;
}
extern "C" {
    pub fn cbrt(arg1: f64) -> f64;
}
extern "C" {
    pub fn cbrtf(arg1: f32) -> f32;
}
extern "C" {
    pub fn cbrtl(arg1: u128) -> u128;
}
extern "C" {
    pub fn ceil(arg1: f64) -> f64;
}
extern "C" {
    pub fn ceilf(arg1: f32) -> f32;
}
extern "C" {
    pub fn ceill(arg1: u128) -> u128;
}
extern "C" {
    pub fn copysign(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn copysignf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn copysignl(arg1: u128, arg2: u128) -> u128;
}
extern "C" {
    pub fn cos(arg1: f64) -> f64;
}
extern "C" {
    pub fn cosf(arg1: f32) -> f32;
}
extern "C" {
    pub fn cosl(arg1: u128) -> u128;
}
extern "C" {
    pub fn cosh(arg1: f64) -> f64;
}
extern "C" {
    pub fn coshf(arg1: f32) -> f32;
}
extern "C" {
    pub fn coshl(arg1: u128) -> u128;
}
extern "C" {
    pub fn erf(arg1: f64) -> f64;
}
extern "C" {
    pub fn erff(arg1: f32) -> f32;
}
extern "C" {
    pub fn erfl(arg1: u128) -> u128;
}
extern "C" {
    pub fn erfc(arg1: f64) -> f64;
}
extern "C" {
    pub fn erfcf(arg1: f32) -> f32;
}
extern "C" {
    pub fn erfcl(arg1: u128) -> u128;
}
extern "C" {
    pub fn exp(arg1: f64) -> f64;
}
extern "C" {
    pub fn expf(arg1: f32) -> f32;
}
extern "C" {
    pub fn expl(arg1: u128) -> u128;
}
extern "C" {
    pub fn exp2(arg1: f64) -> f64;
}
extern "C" {
    pub fn exp2f(arg1: f32) -> f32;
}
extern "C" {
    pub fn exp2l(arg1: u128) -> u128;
}
extern "C" {
    pub fn expm1(arg1: f64) -> f64;
}
extern "C" {
    pub fn expm1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn expm1l(arg1: u128) -> u128;
}
extern "C" {
    pub fn fabs(arg1: f64) -> f64;
}
extern "C" {
    pub fn fabsf(arg1: f32) -> f32;
}
extern "C" {
    pub fn fabsl(arg1: u128) -> u128;
}
extern "C" {
    pub fn fdim(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn fdimf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn fdiml(arg1: u128, arg2: u128) -> u128;
}
extern "C" {
    pub fn floor(arg1: f64) -> f64;
}
extern "C" {
    pub fn floorf(arg1: f32) -> f32;
}
extern "C" {
    pub fn floorl(arg1: u128) -> u128;
}
extern "C" {
    pub fn fma(arg1: f64, arg2: f64, arg3: f64) -> f64;
}
extern "C" {
    pub fn fmaf(arg1: f32, arg2: f32, arg3: f32) -> f32;
}
extern "C" {
    pub fn fmal(arg1: u128, arg2: u128, arg3: u128) -> u128;
}
extern "C" {
    pub fn fmax(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn fmaxf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn fmaxl(arg1: u128, arg2: u128) -> u128;
}
extern "C" {
    pub fn fmin(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn fminf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn fminl(arg1: u128, arg2: u128) -> u128;
}
extern "C" {
    pub fn fmod(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn fmodf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn fmodl(arg1: u128, arg2: u128) -> u128;
}
extern "C" {
    pub fn frexp(arg1: f64, arg2: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn frexpf(arg1: f32, arg2: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn frexpl(arg1: u128, arg2: *mut ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn hypot(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn hypotf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn hypotl(arg1: u128, arg2: u128) -> u128;
}
extern "C" {
    pub fn ilogb(arg1: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ilogbf(arg1: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ilogbl(arg1: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ldexp(arg1: f64, arg2: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn ldexpf(arg1: f32, arg2: ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn ldexpl(arg1: u128, arg2: ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn lgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn lgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lgammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn llrint(arg1: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn llrintf(arg1: f32) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn llrintl(arg1: u128) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn llround(arg1: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn llroundf(arg1: f32) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn llroundl(arg1: u128) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn log(arg1: f64) -> f64;
}
extern "C" {
    pub fn logf(arg1: f32) -> f32;
}
extern "C" {
    pub fn logl(arg1: u128) -> u128;
}
extern "C" {
    pub fn log10(arg1: f64) -> f64;
}
extern "C" {
    pub fn log10f(arg1: f32) -> f32;
}
extern "C" {
    pub fn log10l(arg1: u128) -> u128;
}
extern "C" {
    pub fn log1p(arg1: f64) -> f64;
}
extern "C" {
    pub fn log1pf(arg1: f32) -> f32;
}
extern "C" {
    pub fn log1pl(arg1: u128) -> u128;
}
extern "C" {
    pub fn log2(arg1: f64) -> f64;
}
extern "C" {
    pub fn log2f(arg1: f32) -> f32;
}
extern "C" {
    pub fn log2l(arg1: u128) -> u128;
}
extern "C" {
    pub fn logb(arg1: f64) -> f64;
}
extern "C" {
    pub fn logbf(arg1: f32) -> f32;
}
extern "C" {
    pub fn logbl(arg1: u128) -> u128;
}
extern "C" {
    pub fn lrint(arg1: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn lrintf(arg1: f32) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn lrintl(arg1: u128) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn lround(arg1: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn lroundf(arg1: f32) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn lroundl(arg1: u128) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn modf(arg1: f64, arg2: *mut f64) -> f64;
}
extern "C" {
    pub fn modff(arg1: f32, arg2: *mut f32) -> f32;
}
extern "C" {
    pub fn modfl(arg1: u128, arg2: *mut u128) -> u128;
}
extern "C" {
    pub fn nan(arg1: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn nanf(arg1: *const ::std::os::raw::c_char) -> f32;
}
extern "C" {
    pub fn nanl(arg1: *const ::std::os::raw::c_char) -> u128;
}
extern "C" {
    pub fn nearbyint(arg1: f64) -> f64;
}
extern "C" {
    pub fn nearbyintf(arg1: f32) -> f32;
}
extern "C" {
    pub fn nearbyintl(arg1: u128) -> u128;
}
extern "C" {
    pub fn nextafter(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn nextafterf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn nextafterl(arg1: u128, arg2: u128) -> u128;
}
extern "C" {
    pub fn nexttoward(arg1: f64, arg2: u128) -> f64;
}
extern "C" {
    pub fn nexttowardf(arg1: f32, arg2: u128) -> f32;
}
extern "C" {
    pub fn nexttowardl(arg1: u128, arg2: u128) -> u128;
}
extern "C" {
    pub fn pow(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn powf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn powl(arg1: u128, arg2: u128) -> u128;
}
extern "C" {
    pub fn remainder(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn remainderf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn remainderl(arg1: u128, arg2: u128) -> u128;
}
extern "C" {
    pub fn remquo(arg1: f64, arg2: f64, arg3: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn remquof(arg1: f32, arg2: f32, arg3: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn remquol(arg1: u128, arg2: u128, arg3: *mut ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn rint(arg1: f64) -> f64;
}
extern "C" {
    pub fn rintf(arg1: f32) -> f32;
}
extern "C" {
    pub fn rintl(arg1: u128) -> u128;
}
extern "C" {
    pub fn round(arg1: f64) -> f64;
}
extern "C" {
    pub fn roundf(arg1: f32) -> f32;
}
extern "C" {
    pub fn roundl(arg1: u128) -> u128;
}
extern "C" {
    pub fn scalbln(arg1: f64, arg2: ::std::os::raw::c_long) -> f64;
}
extern "C" {
    pub fn scalblnf(arg1: f32, arg2: ::std::os::raw::c_long) -> f32;
}
extern "C" {
    pub fn scalblnl(arg1: u128, arg2: ::std::os::raw::c_long) -> u128;
}
extern "C" {
    pub fn scalbn(arg1: f64, arg2: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn scalbnf(arg1: f32, arg2: ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn scalbnl(arg1: u128, arg2: ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn sin(arg1: f64) -> f64;
}
extern "C" {
    pub fn sinf(arg1: f32) -> f32;
}
extern "C" {
    pub fn sinl(arg1: u128) -> u128;
}
extern "C" {
    pub fn sinh(arg1: f64) -> f64;
}
extern "C" {
    pub fn sinhf(arg1: f32) -> f32;
}
extern "C" {
    pub fn sinhl(arg1: u128) -> u128;
}
extern "C" {
    pub fn sqrt(arg1: f64) -> f64;
}
extern "C" {
    pub fn sqrtf(arg1: f32) -> f32;
}
extern "C" {
    pub fn sqrtl(arg1: u128) -> u128;
}
extern "C" {
    pub fn tan(arg1: f64) -> f64;
}
extern "C" {
    pub fn tanf(arg1: f32) -> f32;
}
extern "C" {
    pub fn tanl(arg1: u128) -> u128;
}
extern "C" {
    pub fn tanh(arg1: f64) -> f64;
}
extern "C" {
    pub fn tanhf(arg1: f32) -> f32;
}
extern "C" {
    pub fn tanhl(arg1: u128) -> u128;
}
extern "C" {
    pub fn tgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn tgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn tgammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn trunc(arg1: f64) -> f64;
}
extern "C" {
    pub fn truncf(arg1: f32) -> f32;
}
extern "C" {
    pub fn truncl(arg1: u128) -> u128;
}
extern "C" {
    pub static mut signgam: ::std::os::raw::c_int;
}
extern "C" {
    pub fn j0(arg1: f64) -> f64;
}
extern "C" {
    pub fn j1(arg1: f64) -> f64;
}
extern "C" {
    pub fn jn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn y0(arg1: f64) -> f64;
}
extern "C" {
    pub fn y1(arg1: f64) -> f64;
}
extern "C" {
    pub fn yn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn drem(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn dremf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn finite(arg1: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn finitef(arg1: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scalb(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn scalbf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn significand(arg1: f64) -> f64;
}
extern "C" {
    pub fn significandf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lgamma_r(arg1: f64, arg2: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn lgammaf_r(arg1: f32, arg2: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn j0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn j1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn jnf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn y0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn y1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn ynf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn lgammal_r(arg1: u128, arg2: *mut ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn sincos(arg1: f64, arg2: *mut f64, arg3: *mut f64);
}
extern "C" {
    pub fn sincosf(arg1: f32, arg2: *mut f32, arg3: *mut f32);
}
extern "C" {
    pub fn sincosl(arg1: u128, arg2: *mut u128, arg3: *mut u128);
}
extern "C" {
    pub fn exp10(arg1: f64) -> f64;
}
extern "C" {
    pub fn exp10f(arg1: f32) -> f32;
}
extern "C" {
    pub fn exp10l(arg1: u128) -> u128;
}
extern "C" {
    pub fn pow10(arg1: f64) -> f64;
}
extern "C" {
    pub fn pow10f(arg1: f32) -> f32;
}
extern "C" {
    pub fn pow10l(arg1: u128) -> u128;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_int,
    pub tm_zone: *const ::std::os::raw::c_char,
    pub __tm_nsec: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_tm() {
    const UNINIT: ::std::mem::MaybeUninit<tm> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<tm>(),
        48usize,
        concat!("Size of: ", stringify!(tm))
    );
    assert_eq!(
        ::std::mem::align_of::<tm>(),
        4usize,
        concat!("Alignment of ", stringify!(tm))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_min) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_hour) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_hour)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mday) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mon) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_year) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_year)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_wday) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_wday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_yday) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_yday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_isdst) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_isdst)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_gmtoff) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_gmtoff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_zone) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_zone)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__tm_nsec) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(__tm_nsec)
        )
    );
}
extern "C" {
    pub static _CLOCK_MONOTONIC: __clockid;
}
extern "C" {
    pub static _CLOCK_PROCESS_CPUTIME_ID: __clockid;
}
extern "C" {
    pub static _CLOCK_REALTIME: __clockid;
}
extern "C" {
    pub static _CLOCK_THREAD_CPUTIME_ID: __clockid;
}
extern "C" {
    pub fn clock() -> clock_t;
}
extern "C" {
    pub fn time(arg1: *mut time_t) -> time_t;
}
extern "C" {
    pub fn difftime(arg1: time_t, arg2: time_t) -> f64;
}
extern "C" {
    pub fn mktime(arg1: *mut tm) -> time_t;
}
extern "C" {
    pub fn strftime(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: *const ::std::os::raw::c_char,
        arg4: *const tm,
    ) -> usize;
}
extern "C" {
    pub fn gmtime(arg1: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn localtime(arg1: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn asctime(arg1: *const tm) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime(arg1: *const time_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn timespec_get(arg1: *mut timespec, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strftime_l(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: *const ::std::os::raw::c_char,
        arg4: *const tm,
        arg5: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn gmtime_r(arg1: *const time_t, arg2: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn localtime_r(arg1: *const time_t, arg2: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn asctime_r(
        arg1: *const tm,
        arg2: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime_r(
        arg1: *const time_t,
        arg2: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    const UNINIT: ::std::mem::MaybeUninit<itimerspec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<itimerspec>(),
        32usize,
        concat!("Size of: ", stringify!(itimerspec))
    );
    assert_eq!(
        ::std::mem::align_of::<itimerspec>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerspec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).it_interval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).it_value) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_value)
        )
    );
}
extern "C" {
    pub fn nanosleep(arg1: *const timespec, arg2: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getres(arg1: clockid_t, arg2: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_gettime(arg1: clockid_t, arg2: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_nanosleep(
        arg1: clockid_t,
        arg2: ::std::os::raw::c_int,
        arg3: *const timespec,
        arg4: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strptime(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut tm,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub static mut getdate_err: ::std::os::raw::c_int;
}
extern "C" {
    pub fn getdate(arg1: *const ::std::os::raw::c_char) -> *mut tm;
}
extern "C" {
    pub fn timegm(arg1: *mut tm) -> time_t;
}
extern "C" {
    pub fn gettimeofday(
        arg1: *mut timeval,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timezone {
    pub tz_minuteswest: ::std::os::raw::c_int,
    pub tz_dsttime: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_timezone() {
    const UNINIT: ::std::mem::MaybeUninit<timezone> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timezone>(),
        8usize,
        concat!("Size of: ", stringify!(timezone))
    );
    assert_eq!(
        ::std::mem::align_of::<timezone>(),
        4usize,
        concat!("Alignment of ", stringify!(timezone))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tz_minuteswest) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timezone),
            "::",
            stringify!(tz_minuteswest)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tz_dsttime) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(timezone),
            "::",
            stringify!(tz_dsttime)
        )
    );
}
extern "C" {
    pub fn eaccess(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn flock(arg1: ::std::os::raw::c_int, arg2: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setproctitle(fmt: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    pub fn tzset();
}
extern "C" {
    pub fn posix_madvise(
        arg1: *mut ::std::os::raw::c_void,
        arg2: usize,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn geteuid() -> uid_t;
}
extern "C" {
    pub fn getuid() -> uid_t;
}
extern "C" {
    pub fn getegid() -> gid_t;
}
extern "C" {
    pub fn getgid() -> gid_t;
}
extern "C" {
    pub fn getppid() -> pid_t;
}
extern "C" {
    pub fn umask(arg1: mode_t) -> mode_t;
}
extern "C" {
    pub fn chmod(arg1: *const ::std::os::raw::c_char, arg2: mode_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn chown(
        arg1: *const ::std::os::raw::c_char,
        arg2: uid_t,
        arg3: gid_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn pipe(arg1: *mut ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dup(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dup2(arg1: ::std::os::raw::c_int, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn kill(arg1: pid_t, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execl(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execle(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execv(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execve(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const *mut ::std::os::raw::c_char,
        arg3: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn shutdown(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn waitpid(
        arg1: pid_t,
        arg2: *mut ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
    ) -> pid_t;
}
extern "C" {
    pub fn ruby_abi_version() -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn __assert_fail(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
    );
}
pub type VALUE = ::std::os::raw::c_ulong;
pub type ID = ::std::os::raw::c_ulong;
extern "C" {
    #[doc = " Creates a new, anonymous class.\n\n @param[in]  super          What would become a parent class.\n @exception  rb_eTypeError  `super` is not something inheritable.\n @return     An anonymous class that inherits `super`."]
    pub fn rb_class_new(super_: VALUE) -> VALUE;
}
extern "C" {
    #[doc = " The comment  that comes with  this function  says `:nodoc:`.  Not  sure what\n that means though.\n\n @param[out]  clone          Destination object.\n @param[in]   orig           Source object.\n @exception   rb_eTypeError  Cannot copy `orig`.\n @return      The passed `clone`."]
    pub fn rb_mod_init_copy(clone: VALUE, orig: VALUE) -> VALUE;
}
extern "C" {
    #[doc = " Asserts that  the given class  can derive a child  class.  A class  might or\n might not be able to do so; for instance a singleton class cannot.\n\n @param[in]  super          Possible super class.\n @exception  rb_eTypeError  No it cannot.\n @post       Upon successful return `super` can derive."]
    pub fn rb_check_inheritable(super_: VALUE);
}
extern "C" {
    #[doc = " This is a very badly designed API that creates an anonymous class.\n\n @param[in]  id             Discarded for no reason (why...).\n @param[in]  super          What  would  become  a  parent  class.   0  means\n                            ::rb_cObject.\n @exception  rb_eTypeError  `super` is not something inheritable.\n @return     An anonymous class that inherits `super`.\n @warning    You must explicitly name the return value."]
    pub fn rb_define_class_id(id: ID, super_: VALUE) -> VALUE;
}
extern "C" {
    #[doc = " Identical  to rb_define_class_under(),  except  it takes  the  name in  ::ID\n instead of C's string.\n\n @param[out]  outer          A class which contains the new class.\n @param[in]   id             Name of the new class\n @param[in]   super          A class from which the new class will derive.\n                             0 means ::rb_cObject.\n @exception   rb_eTypeError  The constant name `id`  is already taken but the\n                             constant is not a class.\n @exception   rb_eTypeError  The class  is already defined but  the class can\n                             not be  reopened because  its superclass  is not\n                             `super`.\n @exception   rb_eArgError   `super` is NULL.\n @return      The created class.\n @post        `outer::id` refers the returned class.\n @note        If a class named `id` is  already defined and its superclass is\n              `super`, the function just returns the defined class.\n @note        The  compaction  GC does  not  move  classes returned  by  this\n              function."]
    pub fn rb_define_class_id_under(outer: VALUE, id: ID, super_: VALUE) -> VALUE;
}
extern "C" {
    #[doc = " Creates a new, anonymous module.\n\n @return An anonymous module."]
    pub fn rb_module_new() -> VALUE;
}
extern "C" {
    #[doc = " Creates a new, anonymous refinement.\n\n @return An anonymous refinement."]
    pub fn rb_refinement_new() -> VALUE;
}
extern "C" {
    #[doc = " This is a very badly designed API that creates an anonymous module.\n\n @param[in]  id  Discarded for no reason (why...).\n @return     An anonymous module.\n @warning    You must explicitly name the return value."]
    pub fn rb_define_module_id(id: ID) -> VALUE;
}
extern "C" {
    #[doc = " Identical  to rb_define_module_under(),  except it  takes the  name in  ::ID\n instead of C's string.\n\n @param[out]  outer          A class which contains the new module.\n @param[in]   id             Name of the new module\n @exception   rb_eTypeError  The constant name `id`  is already taken but the\n                             constant is not a module.\n @return      The created module.\n @post        `outer::id` refers the returned module.\n @note        The  compaction  GC does  not  move  classes returned  by  this\n              function."]
    pub fn rb_define_module_id_under(outer: VALUE, id: ID) -> VALUE;
}
extern "C" {
    #[doc = " Queries the list of  included modules.  It can also be seen  as a routine to\n first  call rb_mod_ancestors(),  then  rejects non-modules  from the  return\n value.\n\n @param[in]  mod  Class or Module.\n @return     An array of modules that are either included or prepended in any\n             of `mod`'s ancestry tree (including itself)."]
    pub fn rb_mod_included_modules(mod_: VALUE) -> VALUE;
}
extern "C" {
    #[doc = " Queries if the passed module is included by the module.  It can also be seen\n as a routine to first call rb_mod_included_modules(), then see if the return\n value contains the passed module.\n\n @param[in]  child          A Module.\n @param[in]  parent         Another Module.\n @exception  rb_eTypeError  `child` is not an instance of ::rb_cModule.\n @retval     RUBY_Qtrue     `parent` is  either included or prepended  in any\n                            of `child`'s ancestry tree (including itself).\n @return     RUBY_Qfalse    Otherwise."]
    pub fn rb_mod_include_p(child: VALUE, parent: VALUE) -> VALUE;
}
extern "C" {
    #[doc = " Queries the  module's ancestors.  This routine gathers classes  and modules\n that  the  passed  module  either  inherits,  includes,  or  prepends,  then\n recursively applies  that routine again  and again to the  collected entries\n until the list doesn't grow up.\n\n @param[in]  mod  A module or a class.\n @return     An array of  classes or modules that  `mod` possibly recursively\n             inherits, includes, or prepends.\n\n @internal\n\n Above description  is written  in a  recursive language  but in  practice it\n computes the return value iteratively."]
    pub fn rb_mod_ancestors(mod_: VALUE) -> VALUE;
}
extern "C" {
    #[doc = " Queries the class's descendants. This  routine gathers classes that are\n subclasses of the given class (or subclasses of those subclasses, etc.),\n returning an array of classes that have the given class as an ancestor.\n The returned array does not include the given class or singleton classes.\n\n @param[in]  klass A class.\n @return     An array of classes where `klass` is an ancestor.\n\n @internal"]
    pub fn rb_class_descendants(klass: VALUE) -> VALUE;
}
extern "C" {
    #[doc = " Queries the class's direct descendants. This  routine gathers classes that are\n direct subclasses of the given class,\n returning an array of classes that have the given class as a superclass.\n The returned array does not include singleton classes.\n\n @param[in]  klass A class.\n @return     An array of classes where `klass` is the `superclass`.\n\n @internal"]
    pub fn rb_class_subclasses(klass: VALUE) -> VALUE;
}
extern "C" {
    #[doc = "  Returns the attached object for a singleton class.\n  If the given class is not a singleton class, raises a TypeError.\n\n @param[in]  klass A class.\n @return     The object which has the singleton class `klass`.\n\n @internal"]
    pub fn rb_class_attached_object(klass: VALUE) -> VALUE;
}
extern "C" {
    #[doc = " Generates an array of symbols, which are the list of method names defined in\n the passed class.\n\n @param[in]  argc          Number of objects of `argv`.\n @param[in]  argv          Array of  at most  one object, which  controls (if\n                           any) whether  the return array includes  the names\n                           of methods defined in ancestors or not.\n @param[in]  mod           A module or a class.\n @exception  rb_eArgError  `argc` out of range.\n @return     An array  of symbols collecting  names of instance  methods that\n             are not private, defined at `mod`."]
    pub fn rb_class_instance_methods(
        argc: ::std::os::raw::c_int,
        argv: *const VALUE,
        mod_: VALUE,
    ) -> VALUE;
}
extern "C" {
    #[doc = " Identical to rb_class_instance_methods(), except it returns names of methods\n that are public only.\n\n @param[in]  argc          Number of objects of `argv`.\n @param[in]  argv          Array of  at most  one object, which  controls (if\n                           any) whether  the return array includes  the names\n                           of methods defined in ancestors or not.\n @param[in]  mod           A module or a class.\n @exception  rb_eArgError  `argc` out of range.\n @return     An array  of symbols collecting  names of instance  methods that\n             are public, defined at `mod`."]
    pub fn rb_class_public_instance_methods(
        argc: ::std::os::raw::c_int,
        argv: *const VALUE,
        mod_: VALUE,
    ) -> VALUE;
}
extern "C" {
    #[doc = " Identical to rb_class_instance_methods(), except it returns names of methods\n that are protected only.\n\n @param[in]  argc          Number of objects of `argv`.\n @param[in]  argv          Array of  at most  one object, which  controls (if\n                           any) whether  the return array includes  the names\n                           of methods defined in ancestors or not.\n @param[in]  mod           A module or a class.\n @exception  rb_eArgError  `argc` out of range.\n @return     An array  of symbols collecting  names of instance  methods that\n             are protected, defined at `mod`."]
    pub fn rb_class_protected_instance_methods(
        argc: ::std::os::raw::c_int,
        argv: *const VALUE,
        mod_: VALUE,
    ) -> VALUE;
}
extern "C" {
    #[doc = " Identical to rb_class_instance_methods(), except it returns names of methods\n that are private only.\n\n @param[in]  argc          Number of objects of `argv`.\n @param[in]  argv          Array of  at most  one object, which  controls (if\n                           any) whether  the return array includes  the names\n                           of methods defined in ancestors or not.\n @param[in]  mod           A module or a class.\n @exception  rb_eArgError  `argc` out of range.\n @return     An array  of symbols collecting  names of instance  methods that\n             are protected, defined at `mod`."]
    pub fn rb_class_private_instance_methods(
        argc: ::std::os::raw::c_int,
        argv: *const VALUE,
        mod_: VALUE,
    ) -> VALUE;
}
extern "C" {
    #[doc = " Identical  to  rb_class_instance_methods(),  except   it  returns  names  of\n singleton methods instead of instance methods.\n\n @param[in]  argc          Number of objects of `argv`.\n @param[in]  argv          Array of  at most  one object, which  controls (if\n                           any) whether  the return array includes  the names\n                           of methods defined in ancestors or not.\n @param[in]  obj           Arbitrary ruby object.\n @exception  rb_eArgError  `argc` out of range.\n @return     An array  of symbols collecting  names of instance  methods that\n             are not private, defined at the singleton class of `obj`."]
    pub fn rb_obj_singleton_methods(
        argc: ::std::os::raw::c_int,
        argv: *const VALUE,
        obj: VALUE,
    ) -> VALUE;
}
extern "C" {
    #[doc = " Identical to rb_define_method(),  except it takes the name of  the method in\n ::ID instead of C's string.\n\n @param[out]  klass  A module or a class.\n @param[in]   mid    Name of the function.\n @param[in]   func   The method body.\n @param[in]   arity  The number of parameters.  See @ref defmethod.\n @note        There are in fact 18 different prototypes for func.\n @see         ::ruby::backward::cxxanyargs::define_method::rb_define_method_id"]
    pub fn rb_define_method_id(
        klass: VALUE,
        mid: ID,
        func: ::std::option::Option<unsafe extern "C" fn() -> VALUE>,
        arity: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " Inserts a  method entry that hides  previous method definition of  the given\n name.  This is not a deletion of  a method.  Method of the same name defined\n in a parent class is kept invisible in this way.\n\n @param[out]  mod              The module to insert an undef.\n @param[in]   mid              Name of the undef.\n @exception   rb_eTypeError    `klass` is a non-module.\n @exception   rb_eFrozenError  `klass` is frozen.\n @exception   rb_eNameError    No such method named `klass#name`.\n @post        `klass#name` is undefined.\n @see         rb_undef_method\n\n @internal\n\n @shyouhei doesn't  understand why this  is not  the ::ID -taking  variant of\n rb_undef_method(), given rb_remove_method() has its ::ID -taking counterpart\n named rb_remove_method_id()."]
    pub fn rb_undef(mod_: VALUE, mid: ID);
}
extern "C" {
    #[doc = " Identical to rb_define_method(), except it defines a protected method.\n\n @param[out]  klass  A module or a class.\n @param[in]   mid    Name of the function.\n @param[in]   func   The method body.\n @param[in]   arity  The number of parameters.  See @ref defmethod.\n @note        There are in fact 18 different prototypes for func.\n @see         ::ruby::backward::cxxanyargs::define_method::rb_define_protected_method"]
    pub fn rb_define_protected_method(
        klass: VALUE,
        mid: *const ::std::os::raw::c_char,
        func: ::std::option::Option<unsafe extern "C" fn() -> VALUE>,
        arity: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " Identical to rb_define_method(), except it defines a private method.\n\n @param[out]  klass  A module or a class.\n @param[in]   mid    Name of the function.\n @param[in]   func   The method body.\n @param[in]   arity  The number of parameters.  See @ref defmethod.\n @note        There are in fact 18 different prototypes for func.\n @see         ::ruby::backward::cxxanyargs::define_method::rb_define_protected_method"]
    pub fn rb_define_private_method(
        klass: VALUE,
        mid: *const ::std::os::raw::c_char,
        func: ::std::option::Option<unsafe extern "C" fn() -> VALUE>,
        arity: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " Identical to rb_define_method(), except it defines a singleton method.\n\n @param[out]  obj    Arbitrary ruby object.\n @param[in]   mid    Name of the function.\n @param[in]   func   The method body.\n @param[in]   arity  The number of parameters.  See @ref defmethod.\n @note        There are in fact 18 different prototypes for func.\n @see         ::ruby::backward::cxxanyargs::define_method::rb_define_singleton_method"]
    pub fn rb_define_singleton_method(
        obj: VALUE,
        mid: *const ::std::os::raw::c_char,
        func: ::std::option::Option<unsafe extern "C" fn() -> VALUE>,
        arity: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " Finds or creates the singleton class of the passed object.\n\n @param[out]  obj            Arbitrary ruby object.\n @exception   rb_eTypeError  `obj` cannot have its singleton class.\n @return      A (possibly newly allocated) instance of ::rb_cClass.\n @post        `obj` has its singleton class, which is the return value.\n @post        In case `obj` is a class, the returned singleton class also has\n              its own  singleton class  in order to  keep consistency  of the\n              inheritance structure of metaclasses.\n @note        A new  singleton class will  be created  if `obj` did  not have\n              one.\n @note        The  singleton  classes   for  ::RUBY_Qnil,  ::RUBY_Qtrue,  and\n              ::RUBY_Qfalse   are    ::rb_cNilClass,   ::rb_cTrueClass,   and\n              ::rb_cFalseClass respectively.\n\n @internal\n\n You can _create_ a singleton class of a frozen object.  Intentional or ...?\n\n Nowadays there are wider range of  objects who cannot have singleton classes\n than before.  For instance some string instances cannot for some reason."]
    pub fn rb_singleton_class(obj: VALUE) -> VALUE;
}
extern "C" {
    #[doc = " Resembles `__LINE__`.\n\n @retval  0          Current execution context not in a ruby method.\n @retval  otherwise  The current  line number  of the  current thread  of the\n                     current ractor of the current execution context."]
    pub fn rb_sourceline() -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Resembles `__FILE__`.\n\n @retval  0          Current execution context not in a ruby method.\n @retval  otherwise  The current  source path  of the  current thread  of the\n                     current ractor of the current execution context.\n @note    This may or may not be an absolute path."]
    pub fn rb_sourcefile() -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Resembles `__method__`.\n\n @param[out]  idp     Return buffer for method id.\n @param[out]  klassp  Return buffer for class.\n @retval      0       Current execution context not in a method.\n @retval      1       Successful return.\n @post        Upon successful return `*idp` and `*klassp` are updated to have\n              the current method name and its defined class respectively.\n @note        Both parameters can be `NULL`."]
    pub fn rb_frame_method_id_and_class(idp: *mut ID, klassp: *mut VALUE) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Identical  to  rb_funcallv(), except  it  returns  ::RUBY_Qundef instead  of\n raising ::rb_eNoMethodError.\n\n @param[in,out]  recv         Receiver of the method.\n @param[in]      mid          Name of the method to call.\n @param[in]      argc         Number of arguments.\n @param[in]      argv         Arbitrary number of method arguments.\n @retval         RUBY_Qundef  `recv` doesn't respond to `mid`.\n @retval         otherwise    What the method evaluates to."]
    pub fn rb_check_funcall(
        recv: VALUE,
        mid: ID,
        argc: ::std::os::raw::c_int,
        argv: *const VALUE,
    ) -> VALUE;
}
extern "C" {
    #[doc = " Identical to  rb_check_funcall(), except you  can specify how to  handle the\n last element of the given array.  It can also be seen as a routine identical\n to  rb_funcallv_kw(), except  it  returns ::RUBY_Qundef  instead of  raising\n ::rb_eNoMethodError.\n\n @param[in,out]  recv         Receiver of the method.\n @param[in]      mid          Name of the method to call.\n @param[in]      argc         Number of arguments.\n @param[in]      argv         Arbitrary number of method arguments.\n @param[in]      kw_splat     Handling of keyword parameters:\n   - RB_NO_KEYWORDS           `argv`'s last is not a keyword argument.\n   - RB_PASS_KEYWORDS         `argv`'s last is a keyword argument.\n   - RB_PASS_CALLED_KEYWORDS  it depends if there is a passed block.\n @retval         RUBY_Qundef  `recv` doesn't respond to `mid`.\n @retval         otherwise    What the method evaluates to."]
    pub fn rb_check_funcall_kw(
        recv: VALUE,
        mid: ID,
        argc: ::std::os::raw::c_int,
        argv: *const VALUE,
        kw_splat: ::std::os::raw::c_int,
    ) -> VALUE;
}
extern "C" {
    #[doc = " This API  is practically a  variant of rb_proc_call_kw()  now.  Historically\n when there  still was a  concept called `$SAFE`, this  was an API  for that.\n But we  no longer have  that.  This function  basically ended its  role.  It\n just remains here because of no harm.\n\n @param[in]  cmd       A string, or something callable.\n @param[in]  arg       Argument passed to the call.\n @param[in]  kw_splat  Handling of keyword parameters:\n   - RB_NO_KEYWORDS           `arg`'s last is not a keyword argument.\n   - RB_PASS_KEYWORDS         `arg`'s last is a keyword argument.\n   - RB_PASS_CALLED_KEYWORDS  it depends if there is a passed block.\n @return     What the command evaluates to."]
    pub fn rb_eval_cmd_kw(cmd: VALUE, arg: VALUE, kw_splat: ::std::os::raw::c_int) -> VALUE;
}
extern "C" {
    #[doc = " Identical to rb_funcallv(), except it takes Ruby's array instead of C's.\n @param[in,out]  recv               Receiver of the method.\n @param[in]      mid                Name of the method to call.\n @param[in]      args               An instance of ::RArray.\n @exception      rb_eNoMethodError  No such method.\n @exception      rb_eException      Any exceptions happen inside.\n @return         What the method evaluates to.\n @pre            `args` must  be an ::RArray.  Call  `to_ary` beforehand when\n                 necessary."]
    pub fn rb_apply(recv: VALUE, mid: ID, args: VALUE) -> VALUE;
}
extern "C" {
    #[doc = " Evaluates a string  containing Ruby source code, or the  given block, within\n the  context of  the receiver.  In order  to set  the context,  the variable\n `self` is set to `recv` while the  code is executing, giving the code access\n to `recv`'s instance variables and private methods.\n\n When given a block, `recv` is also passed in as the block's only argument.\n\n When  given a  string, the  optional second  and third  parameters supply  a\n filename and starting  line number that are used  when reporting compilation\n errors.\n\n @param[in]  argc  Number of objects in `argv`\n @param[in]  argv  C array of 0 up to 3 elements.\n @param[in]  recv  The object in question.\n @return     What was evaluated."]
    pub fn rb_obj_instance_eval(
        argc: ::std::os::raw::c_int,
        argv: *const VALUE,
        recv: VALUE,
    ) -> VALUE;
}
extern "C" {
    #[doc = " Executes the  given block within the  context of the receiver.   In order to\n set the  context, the  variable `self` is  set to `recv`  while the  code is\n executing, giving the code access to `recv`'s instance variables.  Arguments\n are passed as block parameters.\n\n @param[in]  argc  Number of objects in `argv`\n @param[in]  argv  Arbitrary parameters to be passed to the block.\n @param[in]  recv  The object in question.\n @return     What was evaluated.\n @note       Don't  confuse   this  with  rb_obj_instance_eval().    The  key\n             difference is whether  you can pass arbitrary  parameters to the\n             block, like this:\n\n ```ruby\n class Foo\n   def initialize\n     @foo = 5\n   end\n end\n Foo.new.instance_exec(7) {|i| @foo + i } # => 12\n ```"]
    pub fn rb_obj_instance_exec(
        argc: ::std::os::raw::c_int,
        argv: *const VALUE,
        recv: VALUE,
    ) -> VALUE;
}
extern "C" {
    #[doc = " Identical to rb_obj_instance_eval(), except  it evaluates within the context\n of module.\n\n @param[in]  argc  Number of objects in `argv`\n @param[in]  argv  C array of 0 up to 3 elements.\n @param[in]  mod   The module in question.\n @pre        `mod` must be a Module.\n @return     What was evaluated."]
    pub fn rb_mod_module_eval(
        argc: ::std::os::raw::c_int,
        argv: *const VALUE,
        mod_: VALUE,
    ) -> VALUE;
}
extern "C" {
    #[doc = " Identical to rb_obj_instance_exec(), except  it evaluates within the context\n of module.\n\n @param[in]  argc  Number of objects in `argv`\n @param[in]  argv  Arbitrary parameters to be passed to the block.\n @param[in]  mod   The module in question.\n @pre        `mod` must be a Module.\n @return     What was evaluated."]
    pub fn rb_mod_module_exec(
        argc: ::std::os::raw::c_int,
        argv: *const VALUE,
        mod_: VALUE,
    ) -> VALUE;
}
#[doc = " This is  the type of  functions that ruby calls  when trying to  allocate an\n object.  It is  sometimes necessary to allocate extra memory  regions for an\n object.  When you define a class that uses ::RTypedData, it is typically the\n case.  On  such situations  define a function  of this type  and pass  it to\n rb_define_alloc_func().\n\n @param[in]  klass  The class that this function is registered.\n @return     A newly allocated instance of `klass`."]
pub type rb_alloc_func_t = ::std::option::Option<unsafe extern "C" fn(klass: VALUE) -> VALUE>;
extern "C" {
    #[doc = " Sets the allocator function of a class.\n\n @param[out]  klass  The class to modify.\n @param[in]   func   An allocator function for the class.\n @pre         `klass` must be an instance of Class."]
    pub fn rb_define_alloc_func(klass: VALUE, func: rb_alloc_func_t);
}
extern "C" {
    #[doc = " Deletes the  allocator function of  a class.   It is sometimes  desirable to\n restrict creation  of an instance of  a class.  For example  it rarely makes\n sense for  a DB adaptor class  to allow programmers creating  DB row objects\n without querying  the DB  itself.  You  can kill  sporadic creation  of such\n objects then,  by nullifying  the allocator function  using this  API.  Your\n object shall be allocated using #RB_NEWOBJ_OF() directly.\n\n @param[out]  klass  The class to modify.\n @pre         `klass` must be an instance of Class."]
    pub fn rb_undef_alloc_func(klass: VALUE);
}
extern "C" {
    #[doc = " Queries the allocator function of a class.\n\n @param[in]  klass      The class in question.\n @pre        `klass` must be an instance of Class.\n @retval     0          No allocator function is registered.\n @retval     otherwise  The allocator function.\n\n @internal\n\n Who cares?  @shyouhei finds no practical usage of the return value.  Maybe we\n need KonMari."]
    pub fn rb_get_alloc_func(klass: VALUE) -> rb_alloc_func_t;
}
extern "C" {
    #[doc = " Clears the inline constant caches associated with a particular ID. Extension\n libraries should not bother with such things. Just forget about this API (or\n even, the presence of constant caches)."]
    pub fn rb_clear_constant_cache_for_id(id: ID);
}
extern "C" {
    #[doc = " Resembles `alias`.\n\n @param[out]  klass            Where to define an alias.\n @param[in]   dst              New name.\n @param[in]   src              Existing name.\n @exception   rb_eTypeError    `klass` is not a class.\n @exception   rb_eFrozenError  `klass` is frozen.\n @exception   rb_eNameError    No such method named `src`.\n @post        `klass` has a method named `dst`, which is the identical to its\n              method named `src`."]
    pub fn rb_alias(klass: VALUE, dst: ID, src: ID);
}
extern "C" {
    #[doc = " This function resembles now-deprecated `Module#attr`.\n\n @param[out]  klass              Where to define an attribute.\n @param[in]   name               Name of an instance variable.\n @param[in]   need_reader        Whether attr_reader is needed.\n @param[in]   need_writer        Whether attr_writer is needed.\n @param[in]   honour_visibility  Whether to use the current visibility.\n @exception   rb_eTypeError      `klass` is not a class.\n @exception   rb_eFrozenError    `klass` is frozen.\n @post        If `need_reader` is set `klass` has a method named `name`.\n @post        If `need_writer` is set `klass` has a method named `name=`.\n\n @internal\n\n The three `int` arguments should have been bool, but there was no such thing\n like a bool when K&R was used in this project."]
    pub fn rb_attr(
        klass: VALUE,
        name: ID,
        need_reader: ::std::os::raw::c_int,
        need_writer: ::std::os::raw::c_int,
        honour_visibility: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " Removes a  method.  Don't confuse  this to rb_undef_method(),  which doesn't\n remove a method.  This one resembles `Module#remove_method`.\n\n @param[out]  klass            The class to remove a method.\n @param[in]   name             Name of a method to be removed.\n @exception   rb_eTypeError    `klass` is a non-module.\n @exception   rb_eFrozenError  `klass` is frozen.\n @exception   rb_eNameError    No such method.\n @see         rb_undef_method"]
    pub fn rb_remove_method(klass: VALUE, name: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = " Identical to rb_remove_method(), except it accepts the method name as ::ID.\n\n @param[out]  klass            The class to remove a method.\n @param[in]   mid              Name of a method to be removed.\n @exception   rb_eTypeError    `klass` is a non-module.\n @exception   rb_eFrozenError  `klass` is frozen.\n @exception   rb_eNameError    No such method.\n @see         rb_undef"]
    pub fn rb_remove_method_id(klass: VALUE, mid: ID);
}
extern "C" {
    #[doc = " Queries if the  klass has this method.   This function has only  one line of\n document in the implementation that states \"// deprecated\".  Don't know what\n that means though.\n\n @param[in]  klass  The class in question.\n @param[in]  id     The method name to query.\n @param[in]  ex     Undocumented magic value.\n @retval     false  Method not found.\n @retval     true   There is a method.\n @pre        `klass` must be a module.\n\n @internal\n\n @shyouhei has no  motivation to describe what should be  passed to `ex`.  It\n seems this function should just be trashed."]
    pub fn rb_method_boundp(
        klass: VALUE,
        id: ID,
        ex: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Well...  Let us hesitate from describing what a \"basic definition\" is.  This\n nuanced concept  should have been  kept private.  Just please.   Don't touch\n it.  This function is a badly distributed random number generator.  Right?\n\n @param[in]  klass  The class in question.\n @param[in]  mid    The method name in question.\n @retval     1      It is.\n @retval     0      It isn't."]
    pub fn rb_method_basic_definition_p(klass: VALUE, mid: ID) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Identical to  rb_respond_to(), except  it additionally takes  the visibility\n parameter.   This   does  not   make  difference   unless  the   object  has\n `respond_to?` undefined,  but has `respond_to_missing?` defined.   That case\n the passed argument becomes the second argument of `respond_to_missing?`.\n\n @param[in]  obj        The object in question.\n @param[in]  mid        The method name in question.\n @param[in]  private_p  This    is   the    second   argument    of   `obj`'s\n                        `respond_to_missing?`.\n @retval     1          Yes it does.\n @retval     0          No it doesn't."]
    pub fn rb_obj_respond_to(
        obj: VALUE,
        mid: ID,
        private_p: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Queries if  the object responds  to the  method.  This involves  calling the\n object's `respond_to?` method.\n\n @param[in]  obj        The object in question.\n @param[in]  mid        The method name in question.\n @retval     1          Yes it does.\n @retval     0          No it doesn't."]
    pub fn rb_respond_to(obj: VALUE, mid: ID) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Raises  ::rb_eNotImpError.   This  function  is   used  as  an  argument  to\n rb_define_method() etc.\n\n ```CXX\n rb_define_method(rb_cFoo, \"foo\", rb_f_notimplement, -1);\n ```\n\n @param     argc             Unused parameter.\n @param     argv             Unused parameter.\n @param     obj              Unused parameter.\n @param     marker           Unused parameter.\n @exception rb_eNotImpError  Always.\n @return    Never returns.\n\n @internal\n\n See also the Q&A section of include/ruby/internal/anyargs.h."]
    pub fn rb_f_notimplement(
        argc: ::std::os::raw::c_int,
        argv: *const VALUE,
        obj: VALUE,
        marker: VALUE,
    ) -> !;
}
extern "C" {
    #[doc = " Prints the backtrace  out to the standard error.  This  just confuses people\n for no reason.  Evil souls must only use it.\n\n @internal\n\n Actually it is very useful when called from an interactive GDB session."]
    pub fn rb_backtrace();
}
extern "C" {
    #[doc = " Creates the good old fashioned array-of-strings style backtrace info.\n\n @return  An   array  which   contains   strings,  which   are  the   textual\n          representations of the backtrace locations of the current thread of\n          the current ractor of the current execution context.\n @note    Ruby      scripts      can      access      more      sophisticated\n          `Thread::Backtrace::Location`.  But it seems there  is no way for C\n          extensions to use that API."]
    pub fn rb_make_backtrace() -> VALUE;
}
extern "C" {
    #[doc = " Defines a method.\n\n @param[out]  klass  A module or a class.\n @param[in]   mid    Name of the function.\n @param[in]   func   The method body.\n @param[in]   arity  The number of parameters.  See @ref defmethod.\n @note        There are in fact 18 different prototypes for func.\n @see         ::ruby::backward::cxxanyargs::define_method::rb_define_method"]
    pub fn rb_define_method(
        klass: VALUE,
        mid: *const ::std::os::raw::c_char,
        func: ::std::option::Option<unsafe extern "C" fn() -> VALUE>,
        arity: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " Defines a module function for a module.\n\n @param[out]  klass  A module or a class.\n @param[in]   mid    Name of the function.\n @param[in]   func   The method body.\n @param[in]   arity  The number of parameters.  See @ref defmethod.\n @note        There are in fact 18 different prototypes for func.\n @see         ::ruby::backward::cxxanyargs::define_method::rb_define_module_function"]
    pub fn rb_define_module_function(
        klass: VALUE,
        mid: *const ::std::os::raw::c_char,
        func: ::std::option::Option<unsafe extern "C" fn() -> VALUE>,
        arity: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " Defines a global function.\n\n @param[in]  mid    Name of the function.\n @param[in]  func   The method body.\n @param[in]  arity  The number of parameters.  See @ref defmethod.\n @note       There are in fact 18 different prototypes for func.\n @see        ::ruby::backward::cxxanyargs::define_method::rb_define_global_function"]
    pub fn rb_define_global_function(
        mid: *const ::std::os::raw::c_char,
        func: ::std::option::Option<unsafe extern "C" fn() -> VALUE>,
        arity: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " Defines an undef of a method.  -- What?\n\n In ruby, there are two separate concepts called \"undef\" and \"remove_method\".\n The thing you imagine when you  \"un-define\" a method is remove_method.  This\n one on the  other hand is masking of a  previous method definition.  Suppose\n for instance:\n\n ```ruby\n class Foo\n   def foo\n   end\n end\n\n class Bar < Foo\n   def bar\n     foo\n   end\n end\n\n class Baz < Foo\n   undef foo            # <--- (*1)\n end\n ```\n\n This `undef foo` at `(*1)` must not eliminate `Foo#foo`, because that method\n is also used from `Bar#bar`.  So  instead of physically executing the target\n method, `undef` inserts  a special filtering entry to the  class (`Baz` this\n case).  That entry,  when called, acts as  if there were no  methods at all.\n But the original can still be accessible, via ways like `Bar#bar` above.\n\n @param[out]  klass            The class to insert an undef.\n @param[in]   name             Name of the undef.\n @exception   rb_eTypeError    `klass` is a non-module.\n @exception   rb_eFrozenError  `klass` is frozen.\n @see         rb_remove_method"]
    pub fn rb_undef_method(klass: VALUE, name: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = " Defines an alias of a method.\n\n @param[in,out]  klass            The class which the original method belongs\n                                  to; this is also  where the new method will\n                                  belong to.\n @param[in]      dst              A new name for the method.\n @param[in]      src              The original name of the method.\n @exception      rb_eTypeError    `klass` is a non-module.\n @exception      rb_eFrozenError  `klass` is frozen.\n @exception      rb_eNameError    There is  no such method named  as `src` in\n                                  `klass`.\n\n @internal\n\n Above  description  is   in  fact  a  bit  inaccurate   because  it  ignores\n Refinements."]
    pub fn rb_define_alias(
        klass: VALUE,
        dst: *const ::std::os::raw::c_char,
        src: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[doc = " Defines public accessor method(s) for an attribute.\n\n @param[out]  klass            The class which the attribute will belong to.\n @param[in]   name             Name of the attribute.\n @param[in]   read             Whether to define a getter method.\n @param[in]   write            Whether to define a setter method.\n @exception   rb_eTypeError    `klass` is a non-module.\n @exception   rb_eFrozenError  `klass` is frozen.\n @exception   rb_eNameError    `name` invalid as an attr e.g. an operator."]
    pub fn rb_define_attr(
        klass: VALUE,
        name: *const ::std::os::raw::c_char,
        read: ::std::os::raw::c_int,
        write: ::std::os::raw::c_int,
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _bindgen_ty_1 {
    pub x: *mut VALUE,
    pub y: *const VALUE,
}
#[test]
fn bindgen_test_layout__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<_bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(_bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(_bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_bindgen_ty_1),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_bindgen_ty_1),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _bindgen_ty_2 {
    pub x: *mut VALUE,
    pub y: *const VALUE,
}
#[test]
fn bindgen_test_layout__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<_bindgen_ty_2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_bindgen_ty_2>(),
        4usize,
        concat!("Size of: ", stringify!(_bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<_bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(_bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_bindgen_ty_2),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_bindgen_ty_2),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _bindgen_ty_3 {
    pub x: *mut VALUE,
    pub y: *const VALUE,
}
#[test]
fn bindgen_test_layout__bindgen_ty_3() {
    const UNINIT: ::std::mem::MaybeUninit<_bindgen_ty_3> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_bindgen_ty_3>(),
        4usize,
        concat!("Size of: ", stringify!(_bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<_bindgen_ty_3>(),
        4usize,
        concat!("Alignment of ", stringify!(_bindgen_ty_3))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_bindgen_ty_3),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_bindgen_ty_3),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _bindgen_ty_4 {
    pub x: *mut VALUE,
    pub y: *const VALUE,
}
#[test]
fn bindgen_test_layout__bindgen_ty_4() {
    const UNINIT: ::std::mem::MaybeUninit<_bindgen_ty_4> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_bindgen_ty_4>(),
        4usize,
        concat!("Size of: ", stringify!(_bindgen_ty_4))
    );
    assert_eq!(
        ::std::mem::align_of::<_bindgen_ty_4>(),
        4usize,
        concat!("Alignment of ", stringify!(_bindgen_ty_4))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_bindgen_ty_4),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_bindgen_ty_4),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _bindgen_ty_5 {
    pub x: *mut VALUE,
    pub y: *const VALUE,
}
#[test]
fn bindgen_test_layout__bindgen_ty_5() {
    const UNINIT: ::std::mem::MaybeUninit<_bindgen_ty_5> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_bindgen_ty_5>(),
        4usize,
        concat!("Size of: ", stringify!(_bindgen_ty_5))
    );
    assert_eq!(
        ::std::mem::align_of::<_bindgen_ty_5>(),
        4usize,
        concat!("Alignment of ", stringify!(_bindgen_ty_5))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_bindgen_ty_5),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_bindgen_ty_5),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _bindgen_ty_6 {
    pub x: *mut VALUE,
    pub y: *const VALUE,
}
#[test]
fn bindgen_test_layout__bindgen_ty_6() {
    const UNINIT: ::std::mem::MaybeUninit<_bindgen_ty_6> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_bindgen_ty_6>(),
        4usize,
        concat!("Size of: ", stringify!(_bindgen_ty_6))
    );
    assert_eq!(
        ::std::mem::align_of::<_bindgen_ty_6>(),
        4usize,
        concat!("Alignment of ", stringify!(_bindgen_ty_6))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_bindgen_ty_6),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_bindgen_ty_6),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _bindgen_ty_7 {
    pub x: *mut VALUE,
    pub y: *const VALUE,
}
#[test]
fn bindgen_test_layout__bindgen_ty_7() {
    const UNINIT: ::std::mem::MaybeUninit<_bindgen_ty_7> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_bindgen_ty_7>(),
        4usize,
        concat!("Size of: ", stringify!(_bindgen_ty_7))
    );
    assert_eq!(
        ::std::mem::align_of::<_bindgen_ty_7>(),
        4usize,
        concat!("Alignment of ", stringify!(_bindgen_ty_7))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_bindgen_ty_7),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_bindgen_ty_7),
            "::",
            stringify!(y)
        )
    );
}
extern "C" {
    #[doc = " Converts a C's `intptr_t` into an instance of ::rb_cInteger.\n\n @param[in]  i  Arbitrary `intptr_t` value.\n @return     An instance of ::rb_cInteger.\n @note       This function always allocates Bignums, even if the given number\n             is small enough to fit into a Fixnum."]
    pub fn rb_int2big(i: isize) -> VALUE;
}
extern "C" {
    #[doc = " Converts a C's `intptr_t` into an instance of ::rb_cInteger.\n\n @param[in]  i  Arbitrary `intptr_t` value.\n @return     An instance of ::rb_cInteger."]
    pub fn rb_int2inum(i: isize) -> VALUE;
}
extern "C" {
    #[doc = " Converts a C's `intptr_t` into an instance of ::rb_cInteger.\n\n @param[in]  i  Arbitrary `intptr_t` value.\n @return     An instance of ::rb_cInteger.\n @note       This function always allocates Bignums, even if the given number\n             is small enough to fit into a Fixnum."]
    pub fn rb_uint2big(i: usize) -> VALUE;
}
extern "C" {
    #[doc = " Converts a C's `uintptr_t` into an instance of ::rb_cInteger.\n\n @param[in]  i  Arbitrary `uintptr_t` value.\n @return     An instance of ::rb_cInteger."]
    pub fn rb_uint2inum(i: usize) -> VALUE;
}
pub const ruby_special_consts_RUBY_Qfalse: ruby_special_consts = 0;
pub const ruby_special_consts_RUBY_Qnil: ruby_special_consts = 2;
pub const ruby_special_consts_RUBY_Qtrue: ruby_special_consts = 6;
pub const ruby_special_consts_RUBY_Qundef: ruby_special_consts = 10;
pub const ruby_special_consts_RUBY_IMMEDIATE_MASK: ruby_special_consts = 3;
pub const ruby_special_consts_RUBY_FIXNUM_FLAG: ruby_special_consts = 1;
pub const ruby_special_consts_RUBY_FLONUM_MASK: ruby_special_consts = 0;
pub const ruby_special_consts_RUBY_FLONUM_FLAG: ruby_special_consts = 2;
pub const ruby_special_consts_RUBY_SYMBOL_FLAG: ruby_special_consts = 14;
#[doc = "< Least significant 8 bits are reserved."]
pub const ruby_special_consts_RUBY_SPECIAL_SHIFT: ruby_special_consts = 8;
#[doc = " special constants - i.e. non-zero and non-fixnum constants"]
pub type ruby_special_consts = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " This is an utility function to raise an ::rb_eRangeError.\n\n @param[in]  num             A signed value about to overflow.\n @exception  rb_eRangeError  `num` is out of range of `int`."]
    pub fn rb_out_of_int(num: ::std::os::raw::c_long) -> !;
}
extern "C" {
    #[doc = " Converts an instance of ::rb_cNumeric into C's `long`.\n\n @param[in]  num             Something numeric.\n @exception  rb_eTypeError   `num` is not a numeric.\n @exception  rb_eRangeError  `num` is out of range of `long`.\n @return     The passed value converted into C's `long`."]
    pub fn rb_num2long(num: VALUE) -> ::std::os::raw::c_long;
}
extern "C" {
    #[doc = " Converts an instance of ::rb_cNumeric into C's `unsigned long`.\n\n @param[in]  num             Something numeric.\n @exception  rb_eTypeError   `num` is not a numeric.\n @exception  rb_eRangeError  `num` is out of range of `unsigned long`.\n @return     The passed value converted into C's `unsigned long`."]
    pub fn rb_num2ulong(num: VALUE) -> ::std::os::raw::c_ulong;
}
extern "C" {
    #[doc = " Converts an instance of ::rb_cNumeric into C's `long`.\n\n @param[in]  num             Something numeric.\n @exception  rb_eTypeError   `num` is not a numeric.\n @exception  rb_eRangeError  `num` is out of range of `int`.\n @return     The passed value converted into C's `long`.\n\n @internal\n\n Yes, the  API is  really strange.   It returns `long`,  but raises  when the\n value is out of `int`.  This seems to  be due to the fact that Matz favoured\n K&R before, and his machine at that moment was an ILP32 architecture."]
    pub fn rb_num2int(num: VALUE) -> ::std::os::raw::c_long;
}
extern "C" {
    #[doc = " Identical to rb_num2int().\n\n @param[in]  num             Something numeric.\n @exception  rb_eTypeError   `num` is not a numeric.\n @exception  rb_eRangeError  `num` is out of range of `int`.\n @return     The passed value converted into C's `long`.\n\n @internal\n\n This function seems to be a complete  waste of disk space.  @shyouhei has no\n idea why this is a different thing from rb_num2short()."]
    pub fn rb_fix2int(num: VALUE) -> ::std::os::raw::c_long;
}
extern "C" {
    #[doc = " Converts an instance of ::rb_cNumeric into C's `unsigned long`.\n\n @param[in]  num             Something numeric.\n @exception  rb_eTypeError   `num` is not a numeric.\n @exception  rb_eRangeError  `num` is out of range of `unsigned int`.\n @return     The passed value converted into C's `unsigned long`.\n\n @internal\n\n Yes, the API is really strange.  It returns `unsigned long`, but raises when\n the value is out  of `unsigned int`.  This seems to be due  to the fact that\n Matz  favoured K&R  before, and  his  machine at  that moment  was an  ILP32\n architecture."]
    pub fn rb_num2uint(num: VALUE) -> ::std::os::raw::c_ulong;
}
extern "C" {
    #[doc = " Identical to rb_num2uint().\n\n @param[in]  num             Something numeric.\n @exception  rb_eTypeError   `num` is not a numeric.\n @exception  rb_eRangeError  `num` is out of range of `unsigned int`.\n @return     The passed value converted into C's `unsigned long`.\n\n @internal\n\n This function seems to be a complete  waste of disk space.  @shyouhei has no\n idea why this is a different thing from rb_num2short()."]
    pub fn rb_fix2uint(num: VALUE) -> ::std::os::raw::c_ulong;
}
pub const ruby_rvalue_flags_RVALUE_EMBED_LEN_MAX: ruby_rvalue_flags = 3;
#[doc = " This is an enum because GDB wants it (rather than a macro).  People need not\n bother."]
pub type ruby_rvalue_flags = ::std::os::raw::c_uint;
#[doc = " Ruby's object's,  base components.  Every  single ruby objects have  them in\n common."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RBasic {
    #[doc = " Per-object  flags.  Each  ruby  objects have  their own  characteristics\n apart from their  classes.  For instance whether an object  is frozen or\n not is not  controlled by its class.  This is  where such properties are\n stored.\n\n @see enum ::ruby_fl_type\n\n @note  This is ::VALUE rather than  an enum for alignment purpose.  Back\n        in the 1990s there were no such thing like `_Alignas` in C."]
    pub flags: VALUE,
    #[doc = " Class of an object.  Every object has its class.  Also, everything is an\n object  in Ruby.   This means  classes are  also objects.   Classes have\n their own classes,  classes of classes have their classes,  too ...  and\n it recursively continues forever.\n\n Also note the `const` qualifier.  In  ruby an object cannot \"change\" its\n class."]
    pub klass: VALUE,
}
#[test]
fn bindgen_test_layout_RBasic() {
    const UNINIT: ::std::mem::MaybeUninit<RBasic> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RBasic>(),
        8usize,
        concat!("Size of: ", stringify!(RBasic))
    );
    assert_eq!(
        ::std::mem::align_of::<RBasic>(),
        4usize,
        concat!("Alignment of ", stringify!(RBasic))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RBasic),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).klass) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RBasic),
            "::",
            stringify!(klass)
        )
    );
}
extern "C" {
    #[doc = " Make the object invisible from Ruby code.\n\n It is  useful to let  Ruby's GC manage your  internal data structure  -- The\n object keeps being managed by GC, but `ObjectSpace.each_object` never yields\n the object.\n\n Note that the object also lose a way to call a method on it.\n\n @param[out]  obj  A Ruby object.\n @return      The passed object.\n @post        The object is destructively modified to be invisible.\n @see         rb_obj_reveal"]
    pub fn rb_obj_hide(obj: VALUE) -> VALUE;
}
extern "C" {
    #[doc = " Make a hidden object visible again.\n\n It is  the caller's  responsibility to  pass the  right `klass`  which `obj`\n originally used to belong to.\n\n @param[out]  obj    A Ruby object.\n @param[in]   klass  Class of `obj`.\n @return      Passed `obj`.\n @pre         `obj` was previously hidden.\n @post        `obj`'s class is `klass`.\n @see         rb_obj_hide"]
    pub fn rb_obj_reveal(obj: VALUE, klass: VALUE) -> VALUE;
}
#[doc = " Category unspecified."]
pub const rb_warning_category_t_RB_WARN_CATEGORY_NONE: rb_warning_category_t = 0;
#[doc = " Warning is for deprecated features."]
pub const rb_warning_category_t_RB_WARN_CATEGORY_DEPRECATED: rb_warning_category_t = 1;
#[doc = " Warning is for experimental features."]
pub const rb_warning_category_t_RB_WARN_CATEGORY_EXPERIMENTAL: rb_warning_category_t = 2;
#[doc = " Warning is for experimental features."]
pub const rb_warning_category_t_RB_WARN_CATEGORY_ALL_BITS: rb_warning_category_t = 6;
#[doc = " Warning  categories.  A  warning issued  using this  API can  be selectively\n requested   /   suppressed   by   the  end-users.   For   instance   passing\n `-W:no-deprecated`  to the  ruby process  would suppress  those warnings  in\n deprecated category.\n\n @warning    There is no way to declare a new category (for now)."]
pub type rb_warning_category_t = ::std::os::raw::c_uint;
pub const rb_io_wait_readwrite_RB_IO_WAIT_READABLE: rb_io_wait_readwrite = 0;
pub const rb_io_wait_readwrite_RB_IO_WAIT_WRITABLE: rb_io_wait_readwrite = 1;
#[doc = " for rb_readwrite_sys_fail first argument"]
pub type rb_io_wait_readwrite = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " This is the same as `$!` in Ruby.\n\n @retval   RUBY_Qnil  Not handling exceptions at the moment.\n @retval   otherwise  The current exception in the current thread.\n @ingroup  exception"]
    pub fn rb_errinfo() -> VALUE;
}
extern "C" {
    #[doc = " Sets the current exception (`$!`) to the given value.\n\n @param[in]  err            An instance of ::rb_eException, or ::RUBY_Qnil.\n @exception  rb_eTypeError  What  is given  was  neither ::rb_eException  nor\n                            ::RUBY_Qnil.\n @note       Use  rb_raise()  instead to  raise  `err`.   This function  just\n             assigns the given object to the global variable.\n @ingroup    exception"]
    pub fn rb_set_errinfo(err: VALUE);
}
extern "C" {
    #[doc = " Exception  entry point.   By calling  this  function the  execution of  your\n program gets interrupted to \"raise\" an  exception up to the callee entities.\n Programs could \"rescue\" that exception, or could \"ensure\" some part of them.\n If nobody cares  about such things, the raised exception  reaches at the top\n of execution.  This yields abnormal end of the process.\n\n @param[in]  exc  A subclass of ::rb_eException.\n @param[in]  fmt  Format specifier string compatible with rb_sprintf().\n @exception  exc  The specified exception.\n @note       It never returns."]
    pub fn rb_raise(exc: VALUE, fmt: *const ::std::os::raw::c_char, ...) -> !;
}
extern "C" {
    #[doc = " Raises the unsung \"fatal\" exception.  This is considered severe.  Nobody can\n rescue  the  exception.  Once  raised,  process  termination is  inevitable.\n However ensure clauses still run, so that resources are properly cleaned up.\n\n @param[in]  fmt        Format specifier string compatible with rb_sprintf().\n @exception  rb_eFatal  An exception that you cannot rescue.\n @note       It never returns."]
    pub fn rb_fatal(fmt: *const ::std::os::raw::c_char, ...) -> !;
}
extern "C" {
    #[doc = " Interpreter  panic  switch.   Immediate   process  termination  without  any\n synchronisations shall  occur.  LOTS of  internal states, stack  traces, and\n even  machine registers  are displayed  if possible  for debugging  purposes\n then.\n\n @warning    Do not use this API.\n @warning    You are not expected to use this API.\n @warning    Why not just fix your code instead of calling this API?\n @warning    It was a  bad idea to expose this API  to extension libraries at\n             the first  place.  We just  cannot delete  it at this  point for\n             backwards  compatibility.    That  doesn't  mean   everyone  are\n             welcomed to call this function at will.\n @param[in]  fmt  Format specifier string compatible with rb_sprintf().\n @note       It never returns."]
    pub fn rb_bug(fmt: *const ::std::os::raw::c_char, ...) -> !;
}
extern "C" {
    #[doc = " This is  a wrapper  of rb_bug()  which automatically  constructs appropriate\n message from the passed errno.\n\n @param[in]  msg  Additional message to display.\n @exception  err  C level errno.\n @note       It never returns."]
    pub fn rb_bug_errno(msg: *const ::std::os::raw::c_char, err: ::std::os::raw::c_int) -> !;
}
extern "C" {
    #[doc = " Converts a C errno into a Ruby exception, then raises it.  For instance:\n\n ```CXX\n static VALUE\n foo(VALUE argv)\n {\n    const auto cmd = StringValueCStr(argv);\n    const auto waitr = system(cmd);\n    if (waitr == -1) {\n        rb_sys_fail(\"system(3posix)\"); // <-------------- this\n    }\n    else {\n        return INT2FIX(fd);\n    }\n }\n ```\n\n @param[in]  msg                  Additional message to raise.\n @exception  rb_eSystemCallError  An exception representing errno.\n @note       It never returns."]
    pub fn rb_sys_fail(msg: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[doc = " Identical to  rb_sys_fail(), except  it takes the  message in  Ruby's String\n instead of C's.\n\n @param[in]  msg                  Additional message to raise.\n @exception  rb_eSystemCallError  An exception representing errno.\n @note       It never returns."]
    pub fn rb_sys_fail_str(msg: VALUE) -> !;
}
extern "C" {
    #[doc = " Identical to rb_sys_fail(), except it  takes additional module to extend the\n exception object before raising.\n\n @param[in]  mod                  A ::rb_cModule instance.\n @param[in]  msg                  Additional message to raise.\n @exception  rb_eSystemCallError  An exception representing errno.\n @note       It never returns.\n\n @internal\n\n Does anybody use it?"]
    pub fn rb_mod_sys_fail(mod_: VALUE, msg: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[doc = " Identical to rb_mod_sys_fail(), except it takes the message in Ruby's String\n instead of C's.\n\n @param[in]  mod                  A ::rb_cModule instance.\n @param[in]  msg                  Additional message to raise.\n @exception  rb_eSystemCallError  An exception representing errno.\n @note       It never returns."]
    pub fn rb_mod_sys_fail_str(mod_: VALUE, msg: VALUE) -> !;
}
extern "C" {
    #[doc = " Raises appropriate exception using the parameters.\n\n In Ruby level there are  rb_eEAGAINWaitReadable etc.  This function maps the\n given parameter to an appropriate exception class, then raises it.\n\n @param[in]  waiting  Reason for the IO to wait.\n @param[in]  msg      Additional message to raise.\n @exception  rb_eEAGAINWaitWritable\n @exception  rb_eEWOULDBLOCKWaitWritable\n @exception  rb_eEINPROGRESSWaitWritable\n @exception  rb_eEAGAINWaitReadable\n @exception  rb_eEWOULDBLOCKWaitReadable\n @exception  rb_eEINPROGRESSWaitReadable\n @exception  rb_eSystemCallError\n @note       It never returns."]
    pub fn rb_readwrite_sys_fail(
        waiting: rb_io_wait_readwrite,
        msg: *const ::std::os::raw::c_char,
    ) -> !;
}
extern "C" {
    #[doc = " Breaks from a block.  Because you are  using a CAPI this is not as intuitive\n as  it  sounds.   In order  for  this  function  to  properly work,  make  a\n ::rb_block_call_func_t  function that  calls  it internally,  and pass  that\n function to rb_block_call().\n\n @exception  rb_eLocalJumpError  Called from outside of a block.\n @note       It never returns."]
    pub fn rb_iter_break() -> !;
}
extern "C" {
    #[doc = " Identical to  rb_iter_break(), except it  additionally takes the  \"value\" of\n this breakage.  It  will be the evaluation result of  the iterator.  This is\n kind  of  complicated; you  cannot  see  this as  a  \"return  from a  block\"\n behaviour.  Take a look at this example:\n\n ```ruby\n def foo(q)\n   puts(w = yield(q))\n   puts(e = yield(w))\n   puts(r = yield(e))\n   puts(t = yield(r))\n   puts(y = yield(t))\n   return \"howdy!\"\n end\n\n x = foo(0) {|i|\n   if i > 2\n     break \"hello!\"\n   else\n     next i + 1\n   end\n }\n\n puts x\n ```\n\n This script outputs 1, 2, 3, and hello.  Note that the value passed to break\n becomes the  return value of  foo method, not the  value of yield.   This is\n confusing, but  can be  handy on occasions  e.g.  when you  want to  bring a\n local variable out of a block.\n\n @param[in]  val                 The value of the iterator.\n @exception  rb_eLocalJumpError  Called from outside of a block.\n @note       It never returns."]
    pub fn rb_iter_break_value(val: VALUE) -> !;
}
extern "C" {
    #[doc = " Terminates the current execution context.  This  API is the entry point of a\n \"well-mannered\"  termination  sequence.   When   called  from  an  extension\n library, it  raises ::rb_eSystemExit exception.  Programs  could rescue that\n exception.  Can cancel process exit then.  Otherwise, that exception results\n in a process termination with the status passed to this function.\n\n @param[in]  status          Exit status, see also exit(3).\n @exception  rb_eSystemExit  Exception representing the exit status.\n @note       It never returns.\n\n @internal\n\n \"When called from  an extension library\"?  You might wonder.   In fact there\n are chances for this function to be  called from outside of it, for instance\n when dlopen(3)  failed.  In  case it  is not possible  for this  function to\n raise an exception,  it does not (silently enters to  process cleanup).  But\n that  is a  kind of  implementation detail  which extension  library authors\n should not bother."]
    pub fn rb_exit(status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    #[doc = " @exception  rb_eNotImpError\n @note       It never returns."]
    pub fn rb_notimplement() -> !;
}
extern "C" {
    #[doc = " Creates an exception object that represents the given C errno.\n\n @param[in]  err                  C level errno.\n @param[in]  msg                  Additional message.\n @retval     rb_eSystemCallError  An exception for the errno."]
    pub fn rb_syserr_new(err: ::std::os::raw::c_int, msg: *const ::std::os::raw::c_char) -> VALUE;
}
extern "C" {
    #[doc = " Identical to rb_syserr_new(),  except it takes the message  in Ruby's String\n instead of C's.\n\n @param[in]  n                    C level errno.\n @param[in]  arg                  Additional message.\n @retval     rb_eSystemCallError  An exception for the errno."]
    pub fn rb_syserr_new_str(n: ::std::os::raw::c_int, arg: VALUE) -> VALUE;
}
extern "C" {
    #[doc = " Raises appropriate exception that represents a C errno.\n\n @param[in]  err                  C level errno.\n @param[in]  msg                  Additional message to raise.\n @exception  rb_eSystemCallError  An exception representing `err`.\n @note       It never returns."]
    pub fn rb_syserr_fail(err: ::std::os::raw::c_int, msg: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[doc = " Identical to rb_syserr_fail(), except it  takes the message in Ruby's String\n instead of C's.\n\n @param[in]  err                  C level errno.\n @param[in]  msg                  Additional message to raise.\n @exception  rb_eSystemCallError  An exception representing `err`.\n @note       It never returns."]
    pub fn rb_syserr_fail_str(err: ::std::os::raw::c_int, msg: VALUE) -> !;
}
extern "C" {
    #[doc = " Identical  to rb_mod_sys_fail(),  except  it  does not  depend  on C  global\n variable errno.  Pass it explicitly.\n\n @param[in]  mod                  A ::rb_cModule instance.\n @param[in]  err                  C level errno.\n @param[in]  msg                  Additional message to raise.\n @exception  rb_eSystemCallError  An exception representing `err`.\n @note       It never returns."]
    pub fn rb_mod_syserr_fail(
        mod_: VALUE,
        err: ::std::os::raw::c_int,
        msg: *const ::std::os::raw::c_char,
    ) -> !;
}
extern "C" {
    #[doc = " Identical to  rb_mod_syserr_fail(), except  it takes  the message  in Ruby's\n String instead of C's.\n\n @param[in]  mod                  A ::rb_cModule instance.\n @param[in]  err                  C level errno.\n @param[in]  msg                  Additional message to raise.\n @exception  rb_eSystemCallError  An exception representing `err`.\n @note       It never returns."]
    pub fn rb_mod_syserr_fail_str(mod_: VALUE, err: ::std::os::raw::c_int, msg: VALUE) -> !;
}
extern "C" {
    #[doc = " Identical to rb_readwrite_sys_fail(), except it  does not depend on C global\n variable errno.  Pass it explicitly.\n\n @param[in]  waiting  Reason for the IO to wait.\n @param[in]  err      C level errno.\n @param[in]  msg      Additional message to raise.\n @exception  rb_eEAGAINWaitWritable\n @exception  rb_eEWOULDBLOCKWaitWritable\n @exception  rb_eEINPROGRESSWaitWritable\n @exception  rb_eEAGAINWaitReadable\n @exception  rb_eEWOULDBLOCKWaitReadable\n @exception  rb_eEINPROGRESSWaitReadable\n @exception  rb_eSystemCallError\n @note       It never returns."]
    pub fn rb_readwrite_syserr_fail(
        waiting: rb_io_wait_readwrite,
        err: ::std::os::raw::c_int,
        msg: *const ::std::os::raw::c_char,
    ) -> !;
}
extern "C" {
    #[doc = " Fails with the given object's type incompatibility to the type.\n\n It  seems this  function is  visible from  extension libraries  only because\n RTYPEDDATA_TYPE() uses  it on RUBY_DEBUG.   So you can basically  ignore it;\n use some other fine-grained method instead.\n\n @param[in]  self           The object in question.\n @param[in]  t              Expected type of the object.\n @exception  rb_eTypeError  `self` not in type `t`.\n @note       It never returns.\n @note       The second  argument must  have been an  enum ::ruby_value_type,\n             but for  historical reasons it  remains to  be an int  (in other\n             words we see no benefits fixing this bug)."]
    pub fn rb_unexpected_type(self_: VALUE, t: ::std::os::raw::c_int) -> !;
}
extern "C" {
    #[doc = " @private\n\n This  is an  implementation detail  of #ruby_verbose.   Please don't  use it\n directly.\n\n @retval  Qnil       Interpreter is quiet.\n @retval  Qfalse     Interpreter is kind of chatty.\n @retval  otherwise  Interpreter is very verbose."]
    pub fn rb_ruby_verbose_ptr() -> *mut VALUE;
}
extern "C" {
    #[doc = " @private\n\n This  is an  implementation  detail  of #ruby_debug.   Please  don't use  it\n directly.\n\n @retval  Qnil       Interpreter not in debug mode.\n @retval  Qfalse     Interpreter not in debug mode.\n @retval  otherwise  Interpreter is in debug mode."]
    pub fn rb_ruby_debug_ptr() -> *mut VALUE;
}
extern "C" {
    #[doc = " Issues a warning.\n\n In  ruby, warnings  these  days  are tightly  coupled  with the  rb_mWarning\n constant and its `warn` singleton method.   This CAPI is just a thin wrapper\n of it;  everything passed  are formatted like  what rb_sprintf()  does, then\n passed  through   to  the  method.    Programs  can  have  their   own  `def\n Warning.warn` at will  to do whatever they want, from  ignoring the warnings\n at all to sinking them to some  BigQuery data set via a Fluentd cluster.  By\n default,  the method  just emits  its passed  contents to  ::rb_stderr using\n rb_io_write().\n\n @note       This function is affected by the `-W` flag.\n @param[in]  fmt  Format specifier string compatible with rb_sprintf().\n\n @internal\n\n Above description is in fact inaccurate.  This API interfaces with Ractors."]
    pub fn rb_warning(fmt: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    #[doc = " Identical to rb_warning(), except it takes additional \"category\" parameter.\n\n @param[in]  cat  Name of a known category.\n @param[in]  fmt  Format specifier string compatible with rb_sprintf()."]
    pub fn rb_category_warning(cat: rb_warning_category_t, fmt: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    #[doc = " Issues a compile-time warning  that happens at `__file__:__line__`.  Purpose\n of this function being exposed to CAPI is unclear.\n\n @note       This function is affected by the `-W` flag.\n @param[in]  file  The path corresponding to Ruby level `__FILE__`.\n @param[in]  line  The number corresponding to Ruby level `__LINE__`.\n @param[in]  fmt   Format specifier string compatible with rb_sprintf()."]
    pub fn rb_compile_warning(
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
        fmt: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    #[doc = " Identical to rb_sys_fail(), except it does  not raise an exception to render\n a warning instead.\n\n @note       This function is affected by the `-W` flag.\n @param[in]  fmt  Format specifier string compatible with rb_sprintf()."]
    pub fn rb_sys_warning(fmt: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    #[doc = " Identical to  rb_warning(), except it  reports always regardless  of runtime\n `-W` flag.\n\n @param[in]  fmt  Format specifier string compatible with rb_sprintf()."]
    pub fn rb_warn(fmt: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    #[doc = " Identical to  rb_category_warning(), except it reports  always regardless of\n runtime `-W` flag.\n\n @param[in]  cat  Category e.g. deprecated.\n @param[in]  fmt  Format specifier string compatible with rb_sprintf()."]
    pub fn rb_category_warn(cat: rb_warning_category_t, fmt: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    #[doc = " Identical to  rb_compile_warning(), except  it reports always  regardless of\n runtime `-W` flag.\n\n @param[in]  file  The path corresponding to Ruby level `__FILE__`.\n @param[in]  line  The number corresponding to Ruby level `__LINE__`.\n @param[in]  fmt   Format specifier string compatible with rb_sprintf()."]
    pub fn rb_compile_warn(
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
        fmt: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    #[doc = " Identical to  rb_compile_warn(), except  it also accepts category.\n\n @param[in]  cat   Category e.g. deprecated.\n @param[in]  file  The path corresponding to Ruby level `__FILE__`.\n @param[in]  line  The number corresponding to Ruby level `__LINE__`.\n @param[in]  fmt   Format specifier string compatible with rb_sprintf()."]
    pub fn rb_category_compile_warn(
        cat: rb_warning_category_t,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
        fmt: *const ::std::os::raw::c_char,
        ...
    );
}
#[doc = "< Non-object (swept etc.)"]
pub const ruby_value_type_RUBY_T_NONE: ruby_value_type = 0;
#[doc = "< @see struct ::RObject"]
pub const ruby_value_type_RUBY_T_OBJECT: ruby_value_type = 1;
#[doc = "< @see struct ::RClass and ::rb_cClass"]
pub const ruby_value_type_RUBY_T_CLASS: ruby_value_type = 2;
#[doc = "< @see struct ::RClass and ::rb_cModule"]
pub const ruby_value_type_RUBY_T_MODULE: ruby_value_type = 3;
#[doc = "< @see struct ::RFloat"]
pub const ruby_value_type_RUBY_T_FLOAT: ruby_value_type = 4;
#[doc = "< @see struct ::RString"]
pub const ruby_value_type_RUBY_T_STRING: ruby_value_type = 5;
#[doc = "< @see struct ::RRegexp"]
pub const ruby_value_type_RUBY_T_REGEXP: ruby_value_type = 6;
#[doc = "< @see struct ::RArray"]
pub const ruby_value_type_RUBY_T_ARRAY: ruby_value_type = 7;
#[doc = "< @see struct ::RHash"]
pub const ruby_value_type_RUBY_T_HASH: ruby_value_type = 8;
#[doc = "< @see struct ::RStruct"]
pub const ruby_value_type_RUBY_T_STRUCT: ruby_value_type = 9;
#[doc = "< @see struct ::RBignum"]
pub const ruby_value_type_RUBY_T_BIGNUM: ruby_value_type = 10;
#[doc = "< @see struct ::RFile"]
pub const ruby_value_type_RUBY_T_FILE: ruby_value_type = 11;
#[doc = "< @see struct ::RTypedData"]
pub const ruby_value_type_RUBY_T_DATA: ruby_value_type = 12;
#[doc = "< @see struct ::RMatch"]
pub const ruby_value_type_RUBY_T_MATCH: ruby_value_type = 13;
#[doc = "< @see struct ::RComplex"]
pub const ruby_value_type_RUBY_T_COMPLEX: ruby_value_type = 14;
#[doc = "< @see struct ::RRational"]
pub const ruby_value_type_RUBY_T_RATIONAL: ruby_value_type = 15;
#[doc = "< @see ::RUBY_Qnil"]
pub const ruby_value_type_RUBY_T_NIL: ruby_value_type = 17;
#[doc = "< @see ::RUBY_Qfalse"]
pub const ruby_value_type_RUBY_T_TRUE: ruby_value_type = 18;
#[doc = "< @see ::RUBY_Qtrue"]
pub const ruby_value_type_RUBY_T_FALSE: ruby_value_type = 19;
#[doc = "< @see struct ::RSymbol"]
pub const ruby_value_type_RUBY_T_SYMBOL: ruby_value_type = 20;
#[doc = "< Integers formerly known as Fixnums."]
pub const ruby_value_type_RUBY_T_FIXNUM: ruby_value_type = 21;
#[doc = "< @see ::RUBY_Qundef"]
pub const ruby_value_type_RUBY_T_UNDEF: ruby_value_type = 22;
#[doc = "< @see struct ::RIMemo"]
pub const ruby_value_type_RUBY_T_IMEMO: ruby_value_type = 26;
#[doc = "< @see struct ::RNode"]
pub const ruby_value_type_RUBY_T_NODE: ruby_value_type = 27;
#[doc = "< Hidden classes known as IClasses."]
pub const ruby_value_type_RUBY_T_ICLASS: ruby_value_type = 28;
#[doc = "< @see struct ::RZombie"]
pub const ruby_value_type_RUBY_T_ZOMBIE: ruby_value_type = 29;
#[doc = "< @see struct ::RMoved"]
pub const ruby_value_type_RUBY_T_MOVED: ruby_value_type = 30;
#[doc = "< Bitmask of ::ruby_value_type."]
pub const ruby_value_type_RUBY_T_MASK: ruby_value_type = 31;
#[doc = " C-level type of an object."]
pub type ruby_value_type = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " @private\n\n This was  the old implementation  of Check_Type(), but they  diverged.  This\n one remains  for theoretical backwards compatibility.   People normally need\n not use it.\n\n @param[in]  obj            An object.\n @param[in]  t              A type.\n @exception  rb_eTypeError  `obj` is not of type `t`.\n @exception  rb_eFatal      `obj` is corrupt.\n @post       Upon successful return `obj` is guaranteed to have type `t`.\n\n @internal\n\n The second argument shall have been enum ::ruby_value_type.  But at the time\n matz designed this  function he still used  K&R C.  There was  no such thing\n like a function prototype.  We can no longer change this API."]
    pub fn rb_check_type(obj: VALUE, t: ::std::os::raw::c_int);
}
#[doc = " Number of bits in ::ruby_fl_type that  are _not_ open to users.  This is\n an implementation detail.  Please ignore."]
pub const ruby_fl_ushift_RUBY_FL_USHIFT: ruby_fl_ushift = 12;
#[doc = " This is an enum because GDB wants it (rather than a macro).  People need not\n bother."]
pub type ruby_fl_ushift = ::std::os::raw::c_uint;
#[doc = " @deprecated  This flag once was a thing  back in the old days, but makes\n              no  sense  any longer  today.   Exists  here for  backwards\n              compatibility only.  You can safely forget about it.\n\n @internal\n\n The reality is our GC no  longer remembers write barriers inside of each\n objects, to use  dedicated bitmap instead.  But this flag  is still used\n internally.   The  current  usages  of this  flag  should  be  something\n different, which is unclear to @shyouhei."]
pub const ruby_fl_type_RUBY_FL_WB_PROTECTED: ruby_fl_type = 32;
#[doc = " This flag  has something to do  with our garbage collector.   These days\n ruby  objects are  \"generational\".  There  are those  who are  young and\n those who are old.  Young objects are prone to die; monitored relatively\n extensively by  the garbage  collector.  OTOH old  objects tend  to live\n longer.  They are relatively rarely considered.  This flag is set when a\n object experienced promotion i.e. survived a garbage collection.\n\n @internal\n\n But honestly, @shyouhei  doesn't think this flag should  be visible from\n 3rd parties.  It must be an implementation detail that they should never\n know.  Might better be hidden."]
pub const ruby_fl_type_RUBY_FL_PROMOTED0: ruby_fl_type = 32;
#[doc = " This flag  has something to do  with our garbage collector.   These days\n ruby  objects are  \"generational\".  There  are those  who are  young and\n those who are old.  Young objects are prone to die; monitored relatively\n extensively by  the garbage  collector.  OTOH old  objects tend  to live\n longer.  They are relatively rarely considered.  This flag is set when a\n object  experienced two  promotions  i.e.  survived garbage  collections\n twice.\n\n @internal\n\n But honestly, @shyouhei  doesn't think this flag should  be visible from\n 3rd parties.  It must be an implementation detail that they should never\n know.  Might better be hidden."]
pub const ruby_fl_type_RUBY_FL_PROMOTED1: ruby_fl_type = 64;
#[doc = " This flag  has something to do  with our garbage collector.   These days\n ruby  objects are  \"generational\".  There  are those  who are  young and\n those who are old.  Young objects are prone to die; monitored relatively\n extensively by  the garbage  collector.  OTOH old  objects tend  to live\n longer.  They are relatively rarely considered.  This flag is set when a\n object  experienced  promotions i.e.   survived  more  than one  garbage\n collections.\n\n @internal\n\n But honestly, @shyouhei  doesn't think this flag should  be visible from\n 3rd parties.  It must be an implementation detail that they should never\n know.  Might better be hidden."]
pub const ruby_fl_type_RUBY_FL_PROMOTED: ruby_fl_type = 96;
#[doc = " This flag has  something to do with finalisers.  A  ruby object can have\n its finaliser,  which is another  object that evaluates when  the target\n object is about  to die.  This flag  is used to denote that  there is an\n attached finaliser.\n\n @internal\n\n But honestly, @shyouhei  doesn't think this flag should  be visible from\n 3rd parties.  It must be an implementation detail that they should never\n know.  Might better be hidden."]
pub const ruby_fl_type_RUBY_FL_FINALIZE: ruby_fl_type = 128;
#[doc = " @deprecated  This flag once was a thing  back in the old days, but makes\n              no  sense  any longer  today.   Exists  here for  backwards\n              compatibility only.  You can safely forget about it."]
pub const ruby_fl_type_RUBY_FL_TAINT: ruby_fl_type = 256;
#[doc = " This flag has something to do with Ractor.  Multiple Ractors run without\n protecting each  other.  Sharing an  object among Ractors  are basically\n dangerous,  disabled by  default.   This  flag is  used  to bypass  that\n restriction.  Of  course, you have  to manually prevent  race conditions\n then.\n\n This flag  needs deep  understanding of multithreaded  programming.  You\n would better not use it."]
pub const ruby_fl_type_RUBY_FL_SHAREABLE: ruby_fl_type = 256;
#[doc = " @deprecated  This flag once was a thing  back in the old days, but makes\n              no  sense  any longer  today.   Exists  here for  backwards\n              compatibility only.  You can safely forget about it."]
pub const ruby_fl_type_RUBY_FL_UNTRUSTED: ruby_fl_type = 256;
#[doc = " This flag has something to do with  object IDs.  Unlike in the old days,\n an object's object  ID (that a user can  query using `Object#object_id`)\n is no longer its physical address represented using Ruby level integers.\n It is  now a  monotonic-increasing integer  unrelated to  the underlying\n memory arrangement.  Object IDs are assigned when necessary; objects are\n born without one,  and will eventually have such  property when queried.\n The interpreter has to manage which one is which.  This is the flag that\n helps the  management.  Objects  with this  flag set  are the  ones with\n object IDs assigned.\n\n @internal\n\n But honestly, @shyouhei  doesn't think this flag should  be visible from\n 3rd parties.  It must be an implementation detail that they should never\n know.  Might better be hidden."]
pub const ruby_fl_type_RUBY_FL_SEEN_OBJ_ID: ruby_fl_type = 512;
#[doc = " This flag has something to do with instance variables.  3rd parties need\n not  know, but  there are  several ways  to store  an object's  instance\n variables.   Objects  with this  flag  use  so-called \"generic\"  backend\n storage.  This  distinction is purely an  implementation detail.  People\n need not be aware of this working behind-the-scene.\n\n @internal\n\n As of writing everything except ::RObject and RModule use this scheme."]
pub const ruby_fl_type_RUBY_FL_EXIVAR: ruby_fl_type = 1024;
#[doc = " This flag has something to do with data immutability.  When this flag is\n set an object  is considered \"frozen\".  No modification  are expected to\n happen beyond  that point  for the  particular object.   Immutability is\n basically considered to be a  good property these days.  Library authors\n are expected to obey.  Test this bit before you touch a data structure.\n\n @see rb_check_frozen()"]
pub const ruby_fl_type_RUBY_FL_FREEZE: ruby_fl_type = 2048;
pub const ruby_fl_type_RUBY_FL_USER0: ruby_fl_type = 4096;
pub const ruby_fl_type_RUBY_FL_USER1: ruby_fl_type = 8192;
pub const ruby_fl_type_RUBY_FL_USER2: ruby_fl_type = 16384;
pub const ruby_fl_type_RUBY_FL_USER3: ruby_fl_type = 32768;
pub const ruby_fl_type_RUBY_FL_USER4: ruby_fl_type = 65536;
pub const ruby_fl_type_RUBY_FL_USER5: ruby_fl_type = 131072;
pub const ruby_fl_type_RUBY_FL_USER6: ruby_fl_type = 262144;
pub const ruby_fl_type_RUBY_FL_USER7: ruby_fl_type = 524288;
pub const ruby_fl_type_RUBY_FL_USER8: ruby_fl_type = 1048576;
pub const ruby_fl_type_RUBY_FL_USER9: ruby_fl_type = 2097152;
pub const ruby_fl_type_RUBY_FL_USER10: ruby_fl_type = 4194304;
pub const ruby_fl_type_RUBY_FL_USER11: ruby_fl_type = 8388608;
pub const ruby_fl_type_RUBY_FL_USER12: ruby_fl_type = 16777216;
pub const ruby_fl_type_RUBY_FL_USER13: ruby_fl_type = 33554432;
pub const ruby_fl_type_RUBY_FL_USER14: ruby_fl_type = 67108864;
pub const ruby_fl_type_RUBY_FL_USER15: ruby_fl_type = 134217728;
pub const ruby_fl_type_RUBY_FL_USER16: ruby_fl_type = 268435456;
pub const ruby_fl_type_RUBY_FL_USER17: ruby_fl_type = 536870912;
pub const ruby_fl_type_RUBY_FL_USER18: ruby_fl_type = 1073741824;
pub const ruby_fl_type_RUBY_FL_USER19: ruby_fl_type = -2147483648;
pub const ruby_fl_type_RUBY_ELTS_SHARED: ruby_fl_type = 16384;
#[doc = " This flag has something to do with an object's class.  There are kind of\n classes  called  \"singleton  class\",  each of  which  have  exactly  one\n instance.  What is interesting about  singleton classes is that they are\n created _after_ their instance were instantiated, like this:\n\n ```ruby\n foo = Object.new          # foo is an instance of Object...\n bar = foo.singleton_class # foo is now an instance of bar.\n ```\n\n Here as you see  `bar` is a singleton class of  `foo`, which is injected\n into  `foo`'s inheritance  tree in  a different  statement (==  distinct\n sequence point).   In order to  achieve this property  singleton classes\n are  special-cased in  the  interpreter.   There is  one  bit flag  that\n distinguishes if a class is a singleton class or not, and this is it.\n\n @internal\n\n But honestly, @shyouhei  doesn't think this flag should  be visible from\n 3rd parties.  It must be an implementation detail that they should never\n know.  Might better be hidden."]
pub const ruby_fl_type_RUBY_FL_SINGLETON: ruby_fl_type = 4096;
#[doc = " The  flags.  Each  ruby objects  have their  own characteristics  apart from\n their  classes.  For  instance whether  an object  is frozen  or not  is not\n controlled by its class.  This is the type that represents such properties.\n\n @note  About the `FL_USER` terminology: the \"user\" here does not necessarily\n        mean only  you.  For  instance struct  ::RString instances  use these\n        bits to cache their encodings  etc.  Devs discussed about this topic,\n        reached their  consensus that  ::RUBY_T_DATA is  the only  valid data\n        structure that  can use these  bits; other data  structures including\n        ::RUBY_T_OBJECT  use these  bits  for their  own  purpose.  See  also\n        https://bugs.ruby-lang.org/issues/18059"]
pub type ruby_fl_type = ::std::os::raw::c_int;
#[doc = " @deprecated  This flag once was a thing  back in the old days, but makes\n              no  sense  any longer  today.   Exists  here for  backwards\n              compatibility only.  You can safely forget about it."]
pub const RUBY_FL_DUPPED: _bindgen_ty_8 = 1055;
pub type _bindgen_ty_8 = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " This is an  implementation detail of #RB_OBJ_FREEZE().  People  don't use it\n directly.\n\n @param[out]  klass  A singleton class.\n @post        `klass` gets frozen."]
    pub fn rb_freeze_singleton_class(klass: VALUE);
}
extern "C" {
    pub fn rb_obj_freeze_inline(obj: VALUE);
}
pub const ruby_rstring_flags_RSTRING_NOEMBED: ruby_rstring_flags = 8192;
pub const ruby_rstring_flags_RSTRING_FSTR: ruby_rstring_flags = 536870912;
#[doc = " @private\n\n Bits that you can set to ::RBasic::flags.\n\n @warning  These enums are not the only bits we use for strings.\n\n @internal\n\n Actually all bits  through FL_USER1 to FL_USER19 are used  for strings.  Why\n only this  tiny part of  them are made public  here?  @shyouhei can  find no\n reason."]
pub type ruby_rstring_flags = ::std::os::raw::c_uint;
#[doc = " Ruby's String.  A string in ruby conceptually has these information:\n\n - Encoding of the string.\n - Length of the string.\n - Contents of the string.\n\n It is worth  noting that a string  is _not_ an array of  characters in ruby.\n It has never been.   In 1.x a string was an array of  integers.  Since 2.x a\n string is no longer an array of anything.  A string is a string -- just like\n a Time is not an integer."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct RString {
    #[doc = " Basic part, including flags and class."]
    pub basic: RBasic,
    pub as_: RString__bindgen_ty_1,
}
#[doc = " String's specific fields."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union RString__bindgen_ty_1 {
    pub heap: RString__bindgen_ty_1__bindgen_ty_1,
    pub embed: RString__bindgen_ty_1__bindgen_ty_2,
}
#[doc = " Strings  that use  separated  memory region  for  contents use  this\n pattern."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct RString__bindgen_ty_1__bindgen_ty_1 {
    #[doc = " Length of the string, not including terminating NUL character.\n\n @note  This is in bytes."]
    pub len: ::std::os::raw::c_long,
    #[doc = " Pointer to  the contents of  the string.   In the old  days each\n string had  dedicated memory  regions.  That  is no  longer true\n today,  but there  still are  strings of  such properties.  This\n field could be used to point such things."]
    pub ptr: *mut ::std::os::raw::c_char,
    pub aux: RString__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
}
#[doc = " Auxiliary info."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union RString__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    #[doc = " Capacity of `*ptr`.  A continuous  memory region of at least\n `capa` bytes  is expected to  exist at `*ptr`.  This  can be\n bigger than `len`."]
    pub capa: ::std::os::raw::c_long,
    #[doc = " Parent  of the  string.   Nowadays strings  can share  their\n contents each other, constructing  gigantic nest of objects.\n This situation is called \"shared\",  and this is the field to\n control such properties."]
    pub shared: VALUE,
}
#[test]
fn bindgen_test_layout_RString__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<RString__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RString__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(RString__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<RString__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(RString__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capa) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RString__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(capa)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shared) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RString__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(shared)
        )
    );
}
#[test]
fn bindgen_test_layout_RString__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<RString__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RString__bindgen_ty_1__bindgen_ty_1>(),
        12usize,
        concat!("Size of: ", stringify!(RString__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<RString__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(RString__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RString__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ptr) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RString__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aux) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RString__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(aux)
        )
    );
}
#[doc = " Embedded contents."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RString__bindgen_ty_1__bindgen_ty_2 {
    pub len: ::std::os::raw::c_long,
    pub ary: [::std::os::raw::c_char; 1usize],
}
#[test]
fn bindgen_test_layout_RString__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<RString__bindgen_ty_1__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RString__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(RString__bindgen_ty_1__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<RString__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(RString__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RString__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ary) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RString__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(ary)
        )
    );
}
#[test]
fn bindgen_test_layout_RString__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<RString__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RString__bindgen_ty_1>(),
        12usize,
        concat!("Size of: ", stringify!(RString__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<RString__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(RString__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).heap) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RString__bindgen_ty_1),
            "::",
            stringify!(heap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).embed) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RString__bindgen_ty_1),
            "::",
            stringify!(embed)
        )
    );
}
#[test]
fn bindgen_test_layout_RString() {
    const UNINIT: ::std::mem::MaybeUninit<RString> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RString>(),
        20usize,
        concat!("Size of: ", stringify!(RString))
    );
    assert_eq!(
        ::std::mem::align_of::<RString>(),
        4usize,
        concat!("Alignment of ", stringify!(RString))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).basic) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RString),
            "::",
            stringify!(basic)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).as_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RString),
            "::",
            stringify!(as_)
        )
    );
}
extern "C" {
    #[doc = " Identical to rb_check_string_type(), except it  raises exceptions in case of\n conversion failures.\n\n @param[in]  obj            Target object.\n @exception  rb_eTypeError  No implicit conversion to String.\n @return     Return value of `obj.to_str`.\n @see        rb_io_get_io\n @see        rb_ary_to_ary"]
    pub fn rb_str_to_str(obj: VALUE) -> VALUE;
}
extern "C" {
    #[doc = " Identical to  rb_str_to_str(), except it  fills the passed pointer  with the\n converted object.\n\n @param[in,out]  ptr            Pointer to a variable of target object.\n @exception      rb_eTypeError  No implicit conversion to String.\n @return         Return value of `obj.to_str`.\n @post           `*ptr` is the return value."]
    pub fn rb_string_value(ptr: *mut VALUE) -> VALUE;
}
extern "C" {
    #[doc = " Identical  to  rb_str_to_str(), except  it  returns  the converted  string's\n backend memory region.\n\n @param[in,out]  ptr            Pointer to a variable of target object.\n @exception      rb_eTypeError  No implicit conversion to String.\n @post           `*ptr` is the return value of `obj.to_str`.\n @return         Pointer to the contents of the return value."]
    pub fn rb_string_value_ptr(ptr: *mut VALUE) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Identical to  rb_string_value_ptr(), except  it additionally checks  for the\n contents  for viability  as a  C  string.  Ruby  can accept  wider range  of\n contents as strings, compared to C.  This function is to check that.\n\n @param[in,out]  ptr            Pointer to a variable of target object.\n @exception      rb_eTypeError  No implicit conversion to String.\n @exception      rb_eArgError   String is not C-compatible.\n @post           `*ptr` is the return value of `obj.to_str`.\n @return         Pointer to the contents of the return value."]
    pub fn rb_string_value_cstr(ptr: *mut VALUE) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Identical  to rb_str_to_str(),  except it  additionally converts  the string\n into default  external encoding.   Ruby has a  concept called  encodings.  A\n string can  have different encoding  than the environment  expects.  Someone\n has to make  sure its contents be converted to  something suitable.  This is\n that routine.  Call it when necessary.\n\n @param[in]  obj            Target object.\n @exception  rb_eTypeError  No implicit conversion to String.\n @return     Converted ruby string of default external encoding."]
    pub fn rb_str_export(obj: VALUE) -> VALUE;
}
extern "C" {
    #[doc = " Identical to  rb_str_export(), except it  converts into the  locale encoding\n instead.\n\n @param[in]  obj            Target object.\n @exception  rb_eTypeError  No implicit conversion to String.\n @return     Converted ruby string of locale encoding."]
    pub fn rb_str_export_locale(obj: VALUE) -> VALUE;
}
extern "C" {
    #[doc = " @private\n\n @deprecated  This function  once was a thing  in the old days,  but makes no\n              sense   any   longer   today.   Exists   here   for   backwards\n              compatibility only.  You can safely forget about it."]
    pub fn rb_check_safe_str(arg1: VALUE);
}
extern "C" {
    #[doc = " @private\n\n Prints diagnostic message to stderr when RSTRING_PTR or RSTRING_END\n is NULL.\n\n @param[in]  func           The function name where encountered NULL pointer."]
    pub fn rb_debug_rstring_null_ptr(func: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = " Converts an instance of ::rb_cNumeric into C's `double`.\n\n @param[in]  num             Something numeric.\n @exception  rb_eTypeError   `num` is not a numeric.\n @return     The passed value converted into C's `double`."]
    pub fn rb_num2dbl(num: VALUE) -> f64;
}
extern "C" {
    #[doc = " Extracts its double value from an instance of ::rb_cFloat.\n\n @param[in]  num  An instance of ::rb_cFloat.\n @pre        Must not pass anything other than a Fixnum.\n @return     The passed value converted into C's `double`."]
    pub fn rb_float_value(num: VALUE) -> f64;
}
extern "C" {
    #[doc = " Converts a C's `double` into an instance of ::rb_cFloat.\n\n @param[in]  d  Arbitrary `double` value.\n @return     An instance of ::rb_cFloat."]
    pub fn rb_float_new(d: f64) -> VALUE;
}
extern "C" {
    #[doc = " Identical to rb_float_new(), except it does not generate Flonums.\n\n @param[in]  d  Arbitrary `double` value.\n @return     An instance of ::rb_cFloat.\n\n @internal\n\n @shyouhei has no idea why it is here."]
    pub fn rb_float_new_in_heap(d: f64) -> VALUE;
}
extern "C" {
    #[doc = " Converts a C's `long long` into an instance of ::rb_cInteger.\n\n @param[in]  num  Arbitrary `long long` value.\n @return     An instance of ::rb_cInteger."]
    pub fn rb_ll2inum(num: ::std::os::raw::c_longlong) -> VALUE;
}
extern "C" {
    #[doc = " Converts a C's `unsigned long long` into an instance of ::rb_cInteger.\n\n @param[in]  num  Arbitrary `unsigned long long` value.\n @return     An instance of ::rb_cInteger."]
    pub fn rb_ull2inum(num: ::std::os::raw::c_ulonglong) -> VALUE;
}
extern "C" {
    #[doc = " Converts an instance of ::rb_cNumeric into C's `long long`.\n\n @param[in]  num             Something numeric.\n @exception  rb_eTypeError   `num` is not a numeric.\n @exception  rb_eRangeError  `num` is out of range of `long long`.\n @return     The passed value converted into C's `long long`."]
    pub fn rb_num2ll(num: VALUE) -> ::std::os::raw::c_longlong;
}
extern "C" {
    #[doc = " Converts an instance of ::rb_cNumeric into C's `unsigned long long`.\n\n @param[in]  num             Something numeric.\n @exception  rb_eTypeError   `num` is not a numeric.\n @exception  rb_eRangeError  `num` is out of range of `unsigned long long`.\n @return     The passed value converted into C's `unsigned long long`."]
    pub fn rb_num2ull(num: VALUE) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    #[doc = " Converts an instance of ::rb_cNumeric into C's `short`.\n\n @param[in]  num             Something numeric.\n @exception  rb_eTypeError   `num` is not a numeric.\n @exception  rb_eRangeError  `num` is out of range of `short`.\n @return     The passed value converted into C's `short`."]
    pub fn rb_num2short(num: VALUE) -> ::std::os::raw::c_short;
}
extern "C" {
    #[doc = " Converts an instance of ::rb_cNumeric into C's `unsigned short`.\n\n @param[in]  num             Something numeric.\n @exception  rb_eTypeError   `num` is not a numeric.\n @exception  rb_eRangeError  `num` is out of range of `unsigned short`.\n @return     The passed value converted into C's `unsigned short`."]
    pub fn rb_num2ushort(num: VALUE) -> ::std::os::raw::c_ushort;
}
extern "C" {
    #[doc = " Identical to rb_num2short().\n\n @param[in]  num             Something numeric.\n @exception  rb_eTypeError   `num` is not a numeric.\n @exception  rb_eRangeError  `num` is out of range of `short`.\n @return     The passed value converted into C's `short`.\n\n @internal\n\n This function seems to be a complete  waste of disk space.  @shyouhei has no\n idea why this is a different thing from rb_num2short()."]
    pub fn rb_fix2short(num: VALUE) -> ::std::os::raw::c_short;
}
extern "C" {
    #[doc = " Identical to rb_num2ushort().\n\n @param[in]  num             Something numeric.\n @exception  rb_eTypeError   `num` is not a numeric.\n @exception  rb_eRangeError  `num` is out of range of `unsigned short`.\n @return     The passed value converted into C's `unsigned short`.\n\n @internal\n\n This function seems to be a complete  waste of disk space.  @shyouhei has no\n idea why this is a different thing from rb_num2ushort()."]
    pub fn rb_fix2ushort(num: VALUE) -> ::std::os::raw::c_ushort;
}
pub type st_data_t = ::std::os::raw::c_ulong;
pub type st_index_t = st_data_t;
pub type st_compare_func = ::std::option::Option<
    unsafe extern "C" fn(arg1: st_data_t, arg2: st_data_t) -> ::std::os::raw::c_int,
>;
pub type st_hash_func = ::std::option::Option<unsafe extern "C" fn(arg1: st_data_t) -> st_index_t>;
pub type st_check_for_sizeof_st_index_t = [::std::os::raw::c_char; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_hash_type {
    pub compare: ::std::option::Option<
        unsafe extern "C" fn(arg1: st_data_t, arg2: st_data_t) -> ::std::os::raw::c_int,
    >,
    pub hash: ::std::option::Option<unsafe extern "C" fn(arg1: st_data_t) -> st_index_t>,
}
#[test]
fn bindgen_test_layout_st_hash_type() {
    const UNINIT: ::std::mem::MaybeUninit<st_hash_type> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<st_hash_type>(),
        8usize,
        concat!("Size of: ", stringify!(st_hash_type))
    );
    assert_eq!(
        ::std::mem::align_of::<st_hash_type>(),
        4usize,
        concat!("Alignment of ", stringify!(st_hash_type))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).compare) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(st_hash_type),
            "::",
            stringify!(compare)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hash) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(st_hash_type),
            "::",
            stringify!(hash)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_table_entry {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct st_table {
    pub entry_power: ::std::os::raw::c_uchar,
    pub bin_power: ::std::os::raw::c_uchar,
    pub size_ind: ::std::os::raw::c_uchar,
    pub rebuilds_num: ::std::os::raw::c_uint,
    pub type_: *const st_hash_type,
    pub num_entries: st_index_t,
    pub bins: *mut st_index_t,
    pub entries_start: st_index_t,
    pub entries_bound: st_index_t,
    pub entries: *mut st_table_entry,
}
#[test]
fn bindgen_test_layout_st_table() {
    const UNINIT: ::std::mem::MaybeUninit<st_table> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<st_table>(),
        32usize,
        concat!("Size of: ", stringify!(st_table))
    );
    assert_eq!(
        ::std::mem::align_of::<st_table>(),
        4usize,
        concat!("Alignment of ", stringify!(st_table))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).entry_power) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(st_table),
            "::",
            stringify!(entry_power)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bin_power) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(st_table),
            "::",
            stringify!(bin_power)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size_ind) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(st_table),
            "::",
            stringify!(size_ind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rebuilds_num) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(st_table),
            "::",
            stringify!(rebuilds_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(st_table),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_entries) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(st_table),
            "::",
            stringify!(num_entries)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bins) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(st_table),
            "::",
            stringify!(bins)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).entries_start) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(st_table),
            "::",
            stringify!(entries_start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).entries_bound) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(st_table),
            "::",
            stringify!(entries_bound)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).entries) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(st_table),
            "::",
            stringify!(entries)
        )
    );
}
pub const st_retval_ST_CONTINUE: st_retval = 0;
pub const st_retval_ST_STOP: st_retval = 1;
pub const st_retval_ST_DELETE: st_retval = 2;
pub const st_retval_ST_CHECK: st_retval = 3;
pub const st_retval_ST_REPLACE: st_retval = 4;
pub type st_retval = ::std::os::raw::c_uint;
extern "C" {
    pub fn rb_st_init_table(arg1: *const st_hash_type) -> *mut st_table;
}
extern "C" {
    pub fn rb_st_init_table_with_size(arg1: *const st_hash_type, arg2: st_index_t)
        -> *mut st_table;
}
extern "C" {
    pub fn rb_st_init_numtable() -> *mut st_table;
}
extern "C" {
    pub fn rb_st_init_numtable_with_size(arg1: st_index_t) -> *mut st_table;
}
extern "C" {
    pub fn rb_st_init_strtable() -> *mut st_table;
}
extern "C" {
    pub fn rb_st_init_strtable_with_size(arg1: st_index_t) -> *mut st_table;
}
extern "C" {
    pub fn rb_st_init_strcasetable() -> *mut st_table;
}
extern "C" {
    pub fn rb_st_init_strcasetable_with_size(arg1: st_index_t) -> *mut st_table;
}
extern "C" {
    pub fn rb_st_delete(
        arg1: *mut st_table,
        arg2: *mut st_data_t,
        arg3: *mut st_data_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rb_st_delete_safe(
        arg1: *mut st_table,
        arg2: *mut st_data_t,
        arg3: *mut st_data_t,
        arg4: st_data_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rb_st_shift(
        arg1: *mut st_table,
        arg2: *mut st_data_t,
        arg3: *mut st_data_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rb_st_insert(
        arg1: *mut st_table,
        arg2: st_data_t,
        arg3: st_data_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rb_st_insert2(
        arg1: *mut st_table,
        arg2: st_data_t,
        arg3: st_data_t,
        arg4: ::std::option::Option<unsafe extern "C" fn(arg1: st_data_t) -> st_data_t>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rb_st_lookup(
        arg1: *mut st_table,
        arg2: st_data_t,
        arg3: *mut st_data_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rb_st_get_key(
        arg1: *mut st_table,
        arg2: st_data_t,
        arg3: *mut st_data_t,
    ) -> ::std::os::raw::c_int;
}
pub type st_update_callback_func = ::std::option::Option<
    unsafe extern "C" fn(
        key: *mut st_data_t,
        value: *mut st_data_t,
        arg: st_data_t,
        existing: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn rb_st_update(
        table: *mut st_table,
        key: st_data_t,
        func: st_update_callback_func,
        arg: st_data_t,
    ) -> ::std::os::raw::c_int;
}
pub type st_foreach_callback_func = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: st_data_t,
        arg2: st_data_t,
        arg3: st_data_t,
    ) -> ::std::os::raw::c_int,
>;
pub type st_foreach_check_callback_func = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: st_data_t,
        arg2: st_data_t,
        arg3: st_data_t,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn rb_st_foreach_with_replace(
        tab: *mut st_table,
        func: st_foreach_check_callback_func,
        replace: st_update_callback_func,
        arg: st_data_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rb_st_foreach(
        arg1: *mut st_table,
        arg2: st_foreach_callback_func,
        arg3: st_data_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rb_st_foreach_check(
        arg1: *mut st_table,
        arg2: st_foreach_check_callback_func,
        arg3: st_data_t,
        arg4: st_data_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rb_st_keys(table: *mut st_table, keys: *mut st_data_t, size: st_index_t) -> st_index_t;
}
extern "C" {
    pub fn rb_st_keys_check(
        table: *mut st_table,
        keys: *mut st_data_t,
        size: st_index_t,
        never: st_data_t,
    ) -> st_index_t;
}
extern "C" {
    pub fn rb_st_values(
        table: *mut st_table,
        values: *mut st_data_t,
        size: st_index_t,
    ) -> st_index_t;
}
extern "C" {
    pub fn rb_st_values_check(
        table: *mut st_table,
        values: *mut st_data_t,
        size: st_index_t,
        never: st_data_t,
    ) -> st_index_t;
}
extern "C" {
    pub fn rb_st_add_direct(arg1: *mut st_table, arg2: st_data_t, arg3: st_data_t);
}
extern "C" {
    pub fn rb_st_free_table(arg1: *mut st_table);
}
extern "C" {
    pub fn rb_st_cleanup_safe(arg1: *mut st_table, arg2: st_data_t);
}
extern "C" {
    pub fn rb_st_clear(arg1: *mut st_table);
}
extern "C" {
    pub fn rb_st_copy(arg1: *mut st_table) -> *mut st_table;
}
extern "C" {
    pub fn rb_st_numcmp(arg1: st_data_t, arg2: st_data_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rb_st_numhash(arg1: st_data_t) -> st_index_t;
}
extern "C" {
    pub fn rb_st_locale_insensitive_strcasecmp(
        s1: *const ::std::os::raw::c_char,
        s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rb_st_locale_insensitive_strncasecmp(
        s1: *const ::std::os::raw::c_char,
        s2: *const ::std::os::raw::c_char,
        n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rb_st_memsize(arg1: *const st_table) -> usize;
}
extern "C" {
    pub fn rb_st_hash(ptr: *const ::std::os::raw::c_void, len: usize, h: st_index_t) -> st_index_t;
}
extern "C" {
    pub fn rb_st_hash_uint32(h: st_index_t, i: u32) -> st_index_t;
}
extern "C" {
    pub fn rb_st_hash_uint(h: st_index_t, i: st_index_t) -> st_index_t;
}
extern "C" {
    pub fn rb_st_hash_end(h: st_index_t) -> st_index_t;
}
extern "C" {
    pub fn rb_st_hash_start(h: st_index_t) -> st_index_t;
}
extern "C" {
    pub fn rb_hash_bulk_insert_into_st_table(
        arg1: ::std::os::raw::c_long,
        arg2: *const VALUE,
        arg3: VALUE,
    );
}
extern "C" {
    #[doc = " This  is  the  implementation  of  #RB_OBJ_WRITE().   People  don't  use  it\n directly.\n\n @param[in]   old    An object that points to `young`.\n @param[out]  young  An object that is referenced from `old`."]
    pub fn rb_gc_writebarrier(old: VALUE, young: VALUE);
}
extern "C" {
    #[doc = " This is the  implementation of #RB_OBJ_WB_UNPROTECT().  People  don't use it\n directly.\n\n @param[out] obj  An object that does not participate in WB."]
    pub fn rb_gc_writebarrier_unprotect(obj: VALUE);
}
pub const ruby_rarray_flags_RARRAY_EMBED_FLAG: ruby_rarray_flags = 8192;
pub const ruby_rarray_flags_RARRAY_EMBED_LEN_MASK: ruby_rarray_flags = 4161536;
pub const ruby_rarray_flags_RARRAY_TRANSIENT_FLAG: ruby_rarray_flags = 33554432;
#[doc = " @private\n\n Bits that you can set to ::RBasic::flags.\n\n @warning  These enums are not the only bits we use for arrays.\n\n @internal\n\n Unlike  strings, flag  usages for  arrays  are scattered  across the  entire\n source codes.  @shyouhei doesn't know the complete list.  But what is listed\n here is at least incomplete."]
pub type ruby_rarray_flags = ::std::os::raw::c_uint;
pub const ruby_rarray_consts_RARRAY_EMBED_LEN_SHIFT: ruby_rarray_consts = 15;
#[doc = " This is an enum because GDB wants it (rather than a macro).  People need not\n bother."]
pub type ruby_rarray_consts = ::std::os::raw::c_uint;
#[doc = " Ruby's array."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct RArray {
    #[doc = " Basic part, including flags and class."]
    pub basic: RBasic,
    pub as_: RArray__bindgen_ty_1,
}
#[doc = " Array's specific fields."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union RArray__bindgen_ty_1 {
    pub heap: RArray__bindgen_ty_1__bindgen_ty_1,
    pub ary: [VALUE; 1usize],
}
#[doc = " Arrays  that  use separated  memory  region  for elements  use  this\n pattern."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct RArray__bindgen_ty_1__bindgen_ty_1 {
    #[doc = " Number of elements of the array."]
    pub len: ::std::os::raw::c_long,
    pub aux: RArray__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    #[doc = " Pointer to the C array that holds the elements of the array.  In\n the old days  each array had dedicated memory  regions.  That is\n no  longer  true today,  but  there  still  are arrays  of  such\n properties.  This field could be used to point such things."]
    pub ptr: *const VALUE,
}
#[doc = " Auxiliary info."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union RArray__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    #[doc = " Capacity of `*ptr`.  A continuous  memory region of at least\n `capa` elements is expected to exist at `*ptr`.  This can be\n bigger than `len`."]
    pub capa: ::std::os::raw::c_long,
    pub shared_root: VALUE,
}
#[test]
fn bindgen_test_layout_RArray__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<RArray__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RArray__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(RArray__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<RArray__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(RArray__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capa) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RArray__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(capa)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shared_root) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RArray__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(shared_root)
        )
    );
}
#[test]
fn bindgen_test_layout_RArray__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<RArray__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RArray__bindgen_ty_1__bindgen_ty_1>(),
        12usize,
        concat!("Size of: ", stringify!(RArray__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<RArray__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(RArray__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RArray__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aux) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RArray__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(aux)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RArray__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(ptr)
        )
    );
}
#[test]
fn bindgen_test_layout_RArray__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<RArray__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RArray__bindgen_ty_1>(),
        12usize,
        concat!("Size of: ", stringify!(RArray__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<RArray__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(RArray__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).heap) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RArray__bindgen_ty_1),
            "::",
            stringify!(heap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ary) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RArray__bindgen_ty_1),
            "::",
            stringify!(ary)
        )
    );
}
#[test]
fn bindgen_test_layout_RArray() {
    const UNINIT: ::std::mem::MaybeUninit<RArray> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RArray>(),
        20usize,
        concat!("Size of: ", stringify!(RArray))
    );
    assert_eq!(
        ::std::mem::align_of::<RArray>(),
        4usize,
        concat!("Alignment of ", stringify!(RArray))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).basic) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RArray),
            "::",
            stringify!(basic)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).as_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RArray),
            "::",
            stringify!(as_)
        )
    );
}
extern "C" {
    #[doc = " @private\n\n Declares  a  section of  code  where  raw pointers  are  used.   This is  an\n implementation detail of #RARRAY_PTR_USE.  People don't use it directly.\n\n @param[in]  ary  An object of ::RArray.\n @return     `ary`'s backend C array."]
    pub fn rb_ary_ptr_use_start(ary: VALUE) -> *mut VALUE;
}
extern "C" {
    #[doc = " @private\n\n Declares an  end of  a section  formerly started  by rb_ary_ptr_use_start().\n This is  an implementation detail  of #RARRAY_PTR_USE.  People don't  use it\n directly.\n\n @param[in]  a  An object of ::RArray."]
    pub fn rb_ary_ptr_use_end(a: VALUE);
}
extern "C" {
    #[doc = " Destructively converts an array of transient backend into ordinal one.\n\n @param[out]  a  An object of ::RArray.\n @pre         `a` must be a transient array.\n @post        `a` gets out of transient heap, destructively."]
    pub fn rb_ary_detransient(a: VALUE);
}
extern "C" {
    #[doc = " The \"sign\" of a bignum.\n\n @param[in]  num  An object of RBignum.\n @retval     1    It is greater than or equal to zero.\n @retval     0    It is less than zero.\n\n @internal\n\n Implementation wise, unlike fixnums (which  are 2's complement), bignums are\n signed  magnitude  system.   Theoretically  it could  be  possible  to  have\n negative zero  instances.  But  in reality  there is no  way to  create such\n thing.  Nobody ever needed that kind of insanity."]
    pub fn rb_big_sign(num: VALUE) -> ::std::os::raw::c_int;
}
pub const ruby_rmodule_flags_RMODULE_IS_REFINEMENT: ruby_rmodule_flags = 32768;
#[doc = " @private\n\n Bits that you can set to ::RBasic::flags.\n\n @internal\n\n Why is it here, given RClass itself is not?"]
pub type ruby_rmodule_flags = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RClass {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " Returns the superclass of a class.\n @param[in]  klass        An object of RClass.\n @retval     RUBY_Qfalse  `klass` has no super class.\n @retval     otherwise    Raw superclass of `klass`\n @see        rb_class_superclass\n\n ### Q&A ###\n\n - Q: How can a class have no super class?\n\n - A: `klass` could be a module.  Or it could be ::rb_cBasicObject.\n\n - Q: What do you mean by \"raw\" superclass?\n\n - A: This  is a  really good  question.  The  answer is  that this  function\n      returns something  different from what  you would normally  expect.  On\n      occasions  ruby  inserts  hidden  classes   in  a  hierarchy  of  class\n      inheritance behind-the-scene.   Such classes are called  \"iclass\"es and\n      distinguished  using  ::RUBY_T_ICLASS  in  C  level.   They  are  truly\n      transparent from Ruby  level but can be accessed from  C, by using this\n      API."]
    pub fn rb_class_get_superclass(klass: VALUE) -> VALUE;
}
#[doc = " This is  the type of callbacks  registered to ::RData.  The  argument is the\n `data` field."]
pub type RUBY_DATA_FUNC =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>;
#[doc = " @deprecated\n\n Old  \"untyped\"  user  data.   It  has  roughly  the  same  usage  as  struct\n ::RTypedData, but lacked several features such as support for compaction GC.\n Use of this struct is not recommended  any longer.  If it is dead necessary,\n please inform the core devs about your usage.\n\n @internal\n\n @shyouhei tried to add RBIMPL_ATTR_DEPRECATED for this type but that yielded\n too many warnings  in the core.  Maybe  we want to retry  later...  Just add\n deprecated document for now."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RData {
    #[doc = " Basic part, including flags and class."]
    pub basic: RBasic,
    #[doc = " This function is called when the object is experiencing GC marks.  If it\n contains references to  other Ruby objects, you need to  mark them also.\n Otherwise GC will smash your data.\n\n @see      rb_gc_mark()\n @warning  This  is  called  during  GC  runs.   Object  allocations  are\n           impossible at that moment (that is why GC runs)."]
    pub dmark: RUBY_DATA_FUNC,
    #[doc = " This function is called when the object  is no longer used.  You need to\n do whatever necessary to avoid memory leaks.\n\n @warning  This  is  called  during  GC  runs.   Object  allocations  are\n           impossible at that moment (that is why GC runs)."]
    pub dfree: RUBY_DATA_FUNC,
    #[doc = " Pointer to the actual C level struct that you want to wrap."]
    pub data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_RData() {
    const UNINIT: ::std::mem::MaybeUninit<RData> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RData>(),
        20usize,
        concat!("Size of: ", stringify!(RData))
    );
    assert_eq!(
        ::std::mem::align_of::<RData>(),
        4usize,
        concat!("Alignment of ", stringify!(RData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).basic) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RData),
            "::",
            stringify!(basic)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dmark) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RData),
            "::",
            stringify!(dmark)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dfree) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RData),
            "::",
            stringify!(dfree)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RData),
            "::",
            stringify!(data)
        )
    );
}
extern "C" {
    #[doc = " This is the primitive way to wrap an existing C struct into ::RData.\n\n @param[in]  klass          Ruby level class of the returning object.\n @param[in]  datap          Pointer to the target C struct.\n @param[in]  dmark          Mark function.\n @param[in]  dfree          Free function.\n @exception  rb_eTypeError  `klass` is not a class.\n @exception  rb_eNoMemError  Out of memory.\n @return     An allocated object that wraps `datap`."]
    pub fn rb_data_object_wrap(
        klass: VALUE,
        datap: *mut ::std::os::raw::c_void,
        dmark: RUBY_DATA_FUNC,
        dfree: RUBY_DATA_FUNC,
    ) -> VALUE;
}
extern "C" {
    #[doc = " Identical to  rb_data_object_wrap(), except it  allocates a new  data region\n internally instead of taking an existing  one.  The allocation is done using\n ruby_calloc().   Hence  it  makes  no  sense to  pass  anything  other  than\n ::RUBY_DEFAULT_FREE to the last argument.\n\n @param[in]  klass          Ruby level class of the returning object.\n @param[in]  size           Requested size of memory to allocate.\n @param[in]  dmark          Mark function.\n @param[in]  dfree          Free function.\n @exception  rb_eTypeError  `klass` is not a class.\n @exception  rb_eNoMemError  Out of memory.\n @return     An allocated object that wraps a new `size` byte region."]
    pub fn rb_data_object_zalloc(
        klass: VALUE,
        size: usize,
        dmark: RUBY_DATA_FUNC,
        dfree: RUBY_DATA_FUNC,
    ) -> VALUE;
}
extern "C" {
    #[doc = " @private\n Documented in include/ruby/internal/globals.h"]
    pub static mut rb_cObject: VALUE;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rb_io_t {
    _unused: [u8; 0],
}
#[doc = " Ruby's File  and IO.  Ruby's  IO are not  just file descriptors.   They have\n buffers.   They also  have  encodings.  Various  information are  controlled\n using this struct."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RFile {
    #[doc = " Basic part, including flags and class."]
    pub basic: RBasic,
    #[doc = " IO's specific fields."]
    pub fptr: *mut rb_io_t,
}
#[test]
fn bindgen_test_layout_RFile() {
    const UNINIT: ::std::mem::MaybeUninit<RFile> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RFile>(),
        12usize,
        concat!("Size of: ", stringify!(RFile))
    );
    assert_eq!(
        ::std::mem::align_of::<RFile>(),
        4usize,
        concat!("Alignment of ", stringify!(RFile))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).basic) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RFile),
            "::",
            stringify!(basic)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RFile),
            "::",
            stringify!(fptr)
        )
    );
}
extern "C" {
    #[doc = " Initializes the process for libruby.\n\n This function assumes this process is `ruby(1)` and it has just started.\n Usually programs that embed CRuby interpreter may not call this function,\n and may do their own initialization.\n\n @param[in]  argc  Pointer to process main's `argc`.\n @param[in]  argv  Pointer to process main's `argv`.\n @warning    `argc` and `argv` cannot be `NULL`.\n\n @internal\n\n AFAIK Ruby does write to argv, especially `argv[0][0]`, via setproctitle(3).\n It is intentional that the argument is not const-qualified."]
    pub fn ruby_sysinit(
        argc: *mut ::std::os::raw::c_int,
        argv: *mut *mut *mut ::std::os::raw::c_char,
    );
}
extern "C" {
    #[doc = " Calls ruby_setup() and check error.\n\n Prints errors and calls exit(3) if an error occurred."]
    pub fn ruby_init();
}
extern "C" {
    #[doc = " Processes command line arguments and compiles the Ruby source to execute.\n\n This function does:\n   - Processes the given command line flags and arguments for `ruby(1)`\n   - Compiles the source code from the given argument, `-e` or `stdin`, and\n   - Returns the compiled source as an opaque pointer to an internal data\n     structure\n\n @param[in]  argc  Process main's `argc`.\n @param[in]  argv  Process main's `argv`.\n @return     An opaque pointer to the compiled source or an internal special\n             value.  Pass it to ruby_executable_node() to detect which.\n @see        ruby_executable_node"]
    pub fn ruby_options(
        argc: ::std::os::raw::c_int,
        argv: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Checks the return value of ruby_options().\n\n ruby_options() sometimes returns a special value to indicate this process\n should immediately exit. This function checks if the case. Also stores the\n exit status that the caller have to pass to exit(3) into `*status`.\n\n @param[in]   n          A return value of ruby_options().\n @param[out]  status     Pointer to the exit status of this process.\n @retval      0          The given value is such a special value.\n @retval      otherwise  The given opaque pointer is actually a compiled\n                         source."]
    pub fn ruby_executable_node(
        n: *mut ::std::os::raw::c_void,
        status: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Runs the given compiled source and exits this process.\n\n @param[in]  n             Opaque \"node\" pointer.\n @retval     EXIT_SUCCESS  Successfully run the source.\n @retval     EXIT_FAILURE  An error occurred."]
    pub fn ruby_run_node(n: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Prints the version information of the CRuby interpreter to stdout."]
    pub fn ruby_show_version();
}
extern "C" {
    #[doc = " Prints the copyright notice of the CRuby interpreter to stdout."]
    pub fn ruby_show_copyright();
}
extern "C" {
    #[doc = " Set stack bottom of Ruby implementation.\n\n You  must   call  this   function  before  any   heap  allocation   by  Ruby\n implementation.  Or GC will break living objects.\n\n @param[in]  addr  A pointer somewhere on the stack, near its bottom."]
    pub fn ruby_init_stack(addr: *mut VALUE);
}
extern "C" {
    #[doc = " Initializes the VM and builtin libraries.\n\n @retval  0          Initialization succeeded.\n @retval  otherwise  An error occurred.\n\n @internal\n\n Though not  a part of our  public API, the return  value is in fact  an enum\n ruby_tag_type.  You can  see the potential \"otherwise\" values  by looking at\n vm_core.h."]
    pub fn ruby_setup() -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Destructs the VM.\n\n Runs the VM finalization processes as well as ruby_finalize(), and frees\n resources used by the VM.\n\n @param[in]  ex  Default value to the return value.\n @retval     EXIT_FAILURE  An error occurred.\n @retval     ex            Successful cleanup.\n @note       This function does not raise any exception."]
    pub fn ruby_cleanup(ex: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Runs the VM finalization processes.\n\n `END{}` and procs registered by `Kernel.#at_exit` are executed here. See the\n Ruby language spec for more details.\n\n @note This function is allowed to raise an exception if an error occurred."]
    pub fn ruby_finalize();
}
extern "C" {
    #[doc = " Calls ruby_cleanup() and exits the process."]
    pub fn ruby_stop(arg1: ::std::os::raw::c_int) -> !;
}
extern "C" {
    #[doc = " Checks for stack overflow.\n\n @retval  true   NG machine stack is about to overflow.\n @retval  false  OK there still is a room in the stack.\n\n @internal\n\n Does anybody use it?  So far @shyouhei have never seen any actual use-case."]
    pub fn ruby_stack_check() -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Queries what Ruby thinks is the machine stack.  Ruby manages a region of\n memory.  It calls that area the \"machine stack\".  By calling this function,\n in spite of its name, you can obtain both one end of the stack and its\n length at once.  Which means you can know the entire region.\n\n @param[out]  topnotch  On return the pointer points to the upmost address of\n                        the macihne stack that Ruby knows.\n @return      Length of the machine stack that Ruby knows.\n\n @internal\n\n Does anybody use it?  @shyouhei is quite skeptical if this is useful outside\n of the VM.  Maybe it was a wrong idea to expose this API to 3rd parties."]
    pub fn ruby_stack_length(topnotch: *mut *mut VALUE) -> usize;
}
extern "C" {
    #[doc = " Identical to ruby_run_node(), except it returns an opaque execution status.\n You can pass it to rb_cleanup().\n\n @param[in]  n          Opaque \"node\" pointer.\n @retval     0          Successful end-of-execution.\n @retval     otherwise  An error occurred.\n\n @internal\n\n Though not  a part of our  public API, the return  value is in fact  an enum\n ruby_tag_type.  You can  see the potential \"otherwise\" values  by looking at\n vm_core.h."]
    pub fn ruby_exec_node(n: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Sets the current script name to this value.\n\n This is similar to `$0 = name` in Ruby level but also affects\n `Method#location` and others.\n\n @param[in]  name  File name to set."]
    pub fn ruby_script(name: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = " Identical to ruby_script(), except it takes the name as a Ruby String\n instance.\n\n @param[in]  name  File name to set."]
    pub fn ruby_set_script_name(name: VALUE);
}
extern "C" {
    #[doc = " Defines built-in variables"]
    pub fn ruby_prog_init();
}
extern "C" {
    #[doc = " Sets argv that ruby understands.  Your program might have its own command\n line parameters etc.  Handle them as you wish, and pass remaining parts of\n argv here.\n\n @param[in]  argc  Number of elements of `argv`.\n @param[in]  argv  Command line arguments."]
    pub fn ruby_set_argv(argc: ::std::os::raw::c_int, argv: *mut *mut ::std::os::raw::c_char);
}
extern "C" {
    #[doc = " Identical to ruby_options(), except it raises ruby-level exceptions on\n failure.\n\n @param[in]  argc  Process main's `argc`.\n @param[in]  argv  Process main's `argv`.\n @return     An opaque \"node\" pointer."]
    pub fn ruby_process_options(
        argc: ::std::os::raw::c_int,
        argv: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Sets up `$LOAD_PATH`.\n\n @internal\n\n @shyouhei guesses this has to be called  at very later stage, at least after\n the birth of object system.  But is not exactly sure when."]
    pub fn ruby_init_loadpath();
}
extern "C" {
    #[doc = " Appends the given path to the end of the load path.\n\n @pre        ruby_init_loadpath() must be done beforehand.\n @param[in]  path  The path you want to push to the load path."]
    pub fn ruby_incpush(path: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = " Clear signal handlers.\n\n Ruby installs its own signal handler (apart from those which user scripts\n set).  This is to clear that.  Must be called when the ruby part terminates,\n before switching to your program's own logic."]
    pub fn ruby_sig_finalize();
}
extern "C" {
    pub fn rb_clear_constant_cache();
}
extern "C" {
    #[doc = " This is  the implementation detail  of #RHASH_SIZE.  People don't  call this\n directly.\n\n @param[in]  hash  An instance of RHash.\n @pre        `hash` must be of ::RUBY_T_HASH.\n @return     The size of the hash."]
    pub fn rb_hash_size_num(hash: VALUE) -> usize;
}
extern "C" {
    #[doc = " This is  the implementation  detail of #RHASH_TBL.   People don't  call this\n directly.\n\n @param[in]  hash  An instance of RHash.\n @param[in]  file  The `__FILE__`.\n @param[in]  line  The `__LINE__`.\n @pre        `hash` must be of ::RUBY_T_HASH.\n @return     Table that has the contents of the hash."]
    pub fn rb_hash_tbl(
        hash: VALUE,
        file: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut st_table;
}
extern "C" {
    #[doc = " This is the  implementation detail of #RHASH_SET_IFNONE.   People don't call\n this directly.\n\n @param[out]  hash    An instance of RHash.\n @param[in]   ifnone  Arbitrary default value.\n @pre        `hash` must be of ::RUBY_T_HASH."]
    pub fn rb_hash_set_ifnone(hash: VALUE, ifnone: VALUE) -> VALUE;
}
pub const ruby_robject_flags_ROBJECT_EMBED: ruby_robject_flags = 8192;
#[doc = " @private\n\n Bits that you can set to ::RBasic::flags."]
pub type ruby_robject_flags = ::std::os::raw::c_uint;
#[doc = " Ruby's ordinal objects.  Unless otherwise  special cased, all predefined and\n user-defined classes share this struct to hold their instances."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct RObject {
    #[doc = " Basic part, including flags and class."]
    pub basic: RBasic,
    pub as_: RObject__bindgen_ty_1,
}
#[doc = " Object's specific fields."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union RObject__bindgen_ty_1 {
    pub heap: RObject__bindgen_ty_1__bindgen_ty_1,
    pub ary: [VALUE; 1usize],
}
#[doc = " Object that use  separated memory region for  instance variables use\n this pattern."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RObject__bindgen_ty_1__bindgen_ty_1 {
    #[doc = " Pointer to a C array that holds instance variables."]
    pub ivptr: *mut VALUE,
    #[doc = " This  is a  table that  holds  instance variable  name to  index\n mapping.  Used when accessing instance variables using names.\n\n @internal\n\n This is a shortcut for `RCLASS_IV_INDEX_TBL(rb_obj_class(obj))`."]
    pub iv_index_tbl: *mut rb_id_table,
}
#[test]
fn bindgen_test_layout_RObject__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<RObject__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RObject__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(RObject__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<RObject__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(RObject__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ivptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RObject__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(ivptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iv_index_tbl) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RObject__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(iv_index_tbl)
        )
    );
}
#[test]
fn bindgen_test_layout_RObject__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<RObject__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RObject__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(RObject__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<RObject__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(RObject__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).heap) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RObject__bindgen_ty_1),
            "::",
            stringify!(heap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ary) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RObject__bindgen_ty_1),
            "::",
            stringify!(ary)
        )
    );
}
#[test]
fn bindgen_test_layout_RObject() {
    const UNINIT: ::std::mem::MaybeUninit<RObject> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RObject>(),
        16usize,
        concat!("Size of: ", stringify!(RObject))
    );
    assert_eq!(
        ::std::mem::align_of::<RObject>(),
        4usize,
        concat!("Alignment of ", stringify!(RObject))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).basic) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RObject),
            "::",
            stringify!(basic)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).as_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RObject),
            "::",
            stringify!(as_)
        )
    );
}
pub const ROBJECT_OFFSET_AS_HEAP_IVPTR: i32 = 8;
pub const ROBJECT_OFFSET_AS_HEAP_IV_INDEX_TBL: i32 = 12;
pub const ROBJECT_OFFSET_AS_ARY: i32 = 8;
#[doc = " @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct re_patter_buffer {
    _unused: [u8; 0],
}
#[doc = " Ruby's regular expression.   A regexp is compiled into  its own intermediate\n representation.  This  one holds that  info.  Regexp \"match\"  operation then\n executes that IR."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RRegexp {
    #[doc = " Basic part, including flags and class."]
    pub basic: RBasic,
    #[doc = " The pattern buffer.   This is a quasi-opaque struct  that holds compiled\n intermediate representation of the regular expression.\n\n @note  Compilation of a regexp could be delayed until actual match."]
    pub ptr: *mut re_pattern_buffer,
    #[doc = " Source code of this expression."]
    pub src: VALUE,
    #[doc = " Reference count.  A  regexp match can take extraordinarily  long time to\n run.  Ruby's  regular expression is  heavily extended and not  a regular\n language any  longer; runs in NP-time  in practice.  Now, Ruby  also has\n threads and GVL.  In order to prevent long GVL lockup, our regexp engine\n can release it on occasions.  This means that multiple threads can touch\n a regular expressions at once.  That  itself is okay.  But their cleanup\n phase shall wait for all  the concurrent runs, to prevent use-after-free\n situation.  This field is used to  count such threads that are executing\n this particular pattern buffer.\n\n @warning  Of course, touching this field from extension libraries causes\n           catastrophic effects.  Just leave it."]
    pub usecnt: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_RRegexp() {
    const UNINIT: ::std::mem::MaybeUninit<RRegexp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RRegexp>(),
        20usize,
        concat!("Size of: ", stringify!(RRegexp))
    );
    assert_eq!(
        ::std::mem::align_of::<RRegexp>(),
        4usize,
        concat!("Alignment of ", stringify!(RRegexp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).basic) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RRegexp),
            "::",
            stringify!(basic)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RRegexp),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).src) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RRegexp),
            "::",
            stringify!(src)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).usecnt) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RRegexp),
            "::",
            stringify!(usecnt)
        )
    );
}
extern "C" {
    #[doc = " Returns the number of struct members.\n\n @param[in]  st  An instance of RStruct.\n @return     The number of members of `st`.\n @pre        `st` must be of ::RUBY_T_STRUCT."]
    pub fn rb_struct_size(st: VALUE) -> VALUE;
}
extern "C" {
    #[doc = " Resembles `Struct#[]`.\n\n @param[in]  st              An instance of RStruct.\n @param[in]  k               Index a.k.a. key of the struct.\n @exception  rb_eTypeError   `k` is neither Numeric, Symbol, nor String.\n @exception  rb_eIndexError  Numerical index out of range.\n @exception  rb_eNameError   No such key.\n @return     The member stored at `k` in `st`.\n @pre        `st` must be of ::RUBY_T_STRUCT."]
    pub fn rb_struct_aref(st: VALUE, k: VALUE) -> VALUE;
}
extern "C" {
    #[doc = " Resembles `Struct#[]=`.\n\n @param[out]  st              An instance of RStruct.\n @param[in]   k               Index a.k.a. key of the struct.\n @param[in]   v               Value to store.\n @exception  rb_eTypeError    `k` is neither Numeric, Symbol, nor String.\n @exception  rb_eIndexError   Numerical index out of range.\n @exception  rb_eNameError    No such key.\n @return     Passed `v`.\n @pre        `st` must be of ::RUBY_T_STRUCT.\n @post       `v` is stored at `k` in `st`."]
    pub fn rb_struct_aset(st: VALUE, k: VALUE, v: VALUE) -> VALUE;
}
pub const rbimpl_typeddata_flags_RUBY_TYPED_FREE_IMMEDIATELY: rbimpl_typeddata_flags = 1;
pub const rbimpl_typeddata_flags_RUBY_TYPED_FROZEN_SHAREABLE: rbimpl_typeddata_flags = 256;
pub const rbimpl_typeddata_flags_RUBY_TYPED_WB_PROTECTED: rbimpl_typeddata_flags = 32;
pub const rbimpl_typeddata_flags_RUBY_TYPED_PROMOTED1: rbimpl_typeddata_flags = 64;
#[doc = " @private\n\n Bits for rb_data_type_struct::flags."]
pub type rbimpl_typeddata_flags = ::std::os::raw::c_uint;
#[doc = " @copydoc rb_data_type_t"]
pub type rb_data_type_t = rb_data_type_struct;
#[doc = " @copydoc rb_data_type_t"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rb_data_type_struct {
    #[doc = " Name of  structs of this  kind.  This  is used for  diagnostic purposes.\n This has  to be unique  in the  process, but doesn't  has to be  a valid\n C/Ruby identifier."]
    pub wrap_struct_name: *const ::std::os::raw::c_char,
    pub function: rb_data_type_struct__bindgen_ty_1,
    #[doc = " Parent  of  this  class.   Sometimes  C  structs  have  inheritance-like\n relationships.  An example is `struct sockaddr`  and its family.  If you\n design such things,  make ::rb_data_type_t for each of  them and connect\n using this field.   Ruby can then transparently cast your  data back and\n forth when you call #TypedData_Get_Struct().\n\n ```CXX\n struct parent { };\n static inline const rb_data_type_t parent_type = {\n     .wrap_struct_name = \"parent\",\n };\n\n struct child: public parent { };\n static inline const rb_data_type_t child_type = {\n     .wrap_struct_name = \"child\",\n     .parent = &parent_type,\n };\n\n // This function can take both parent_class and child_class.\n static inline struct parent *\n get_parent(VALUE v)\n {\n     struct parent *p;\n     TypedData_Get_Struct(v, parent_type, struct parent, p);\n     return p;\n }\n ```"]
    pub parent: *const rb_data_type_t,
    #[doc = " Type-specific static data.   This area can be used for  any purpose by a\n programmer who define the type.  Ruby does not manage this at all."]
    pub data: *mut ::std::os::raw::c_void,
    #[doc = " Type-specific behavioural  characteristics.  This is a  bitfield.  It is\n an EXTREMELY  WISE IDEA to  leave this field  blank.  It is  designed so\n that setting  zero is the safest  thing to do.   If you risk to  set any\n bits on, you have to know exactly what you are doing.\n\n @internal\n\n Why it has to be a ::VALUE?  @shyouhei doesn't understand the design."]
    pub flags: VALUE,
}
#[doc = " Function pointers.  Resembles C++ `vtbl`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rb_data_type_struct__bindgen_ty_1 {
    #[doc = " This function  is called when  the object is experiencing  GC marks.\n If it  contains references to other  Ruby objects, you need  to mark\n them also.  Otherwise GC will smash your data.\n\n @see      rb_gc_mark()\n @warning  This  is called  during GC  runs.  Object  allocations are\n           impossible at that moment (that is why GC runs)."]
    pub dmark: RUBY_DATA_FUNC,
    #[doc = " This function is called when the object is no longer used.  You need\n to do whatever necessary to avoid memory leaks.\n\n @warning  This  is called  during GC  runs.  Object  allocations are\n           impossible at that moment (that is why GC runs)."]
    pub dfree: RUBY_DATA_FUNC,
    #[doc = " This function is to query the size of the underlying memory regions.\n\n @internal\n\n This  function  has  only  one   usage,  which  is  form  inside  of\n `ext/objspace`."]
    pub dsize:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const ::std::os::raw::c_void) -> usize>,
    #[doc = " This  function  is  called  when  the  object  is  relocated.   Like\n ::rb_data_type_struct::dmark, you need to  update references to Ruby\n objects inside of your structs.\n\n @see      rb_gc_location()\n @warning  This  is called  during GC  runs.  Object  allocations are\n           impossible at that moment (that is why GC runs)."]
    pub dcompact: RUBY_DATA_FUNC,
    #[doc = " This field  is reserved for future  extension.  For now, it  must be\n filled with zeros."]
    pub reserved: [*mut ::std::os::raw::c_void; 1usize],
}
#[test]
fn bindgen_test_layout_rb_data_type_struct__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<rb_data_type_struct__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rb_data_type_struct__bindgen_ty_1>(),
        20usize,
        concat!("Size of: ", stringify!(rb_data_type_struct__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<rb_data_type_struct__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(rb_data_type_struct__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dmark) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rb_data_type_struct__bindgen_ty_1),
            "::",
            stringify!(dmark)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dfree) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rb_data_type_struct__bindgen_ty_1),
            "::",
            stringify!(dfree)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dsize) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rb_data_type_struct__bindgen_ty_1),
            "::",
            stringify!(dsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dcompact) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rb_data_type_struct__bindgen_ty_1),
            "::",
            stringify!(dcompact)
        )
